---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["兽人古墓"] = {
 		["key_name"]=[[兽人古墓]],
		["checkmapid"]=[[兽人古墓]], 
	},
	["兽王墓穴"] = {
 		["key_name"]=[[兽王墓穴]],
		["checkmapid"]=[[兽人古墓]], 
	},
	["僵尸矿区"] = {
 		["key_name"]=[[僵尸矿区]],
		["checkmapid"]=[[僵尸矿区]], 
	},
	["尸王领地"] = {
 		["key_name"]=[[尸王领地]],
		["checkmapid"]=[[僵尸矿区]], 
	},
	["蜈蚣洞穴"] = {
 		["key_name"]=[[蜈蚣洞穴]],
		["checkmapid"]=[[蜈蚣洞穴]], 
	},
	["死亡棺材"] = {
 		["key_name"]=[[死亡棺材]],
		["checkmapid"]=[[蜈蚣洞穴]], 
	},
	["沃玛寺庙"] = {
 		["key_name"]=[[沃玛寺庙]],
		["checkmapid"]=[[沃玛寺庙]], 
	},
	["沃玛神殿"] = {
 		["key_name"]=[[沃玛神殿]],
		["checkmapid"]=[[沃玛寺庙]], 
	},
	["石墓猪洞"] = {
 		["key_name"]=[[石墓猪洞]],
		["checkmapid"]=[[石墓猪洞]], 
	},
	["石墓禁地"] = {
 		["key_name"]=[[石墓禁地]],
		["checkmapid"]=[[石墓猪洞]], 
	},
	["祖玛寺庙"] = {
 		["key_name"]=[[祖玛寺庙]],
		["checkmapid"]=[[祖玛寺庙]], 
	},
	["教主之家"] = {
 		["key_name"]=[[教主之家]],
		["checkmapid"]=[[祖玛寺庙]], 
	},
	["抉择之地"] = {
 		["key_name"]=[[抉择之地]],
		["checkmapid"]=[[抉择之地]], 
	},
	["赤月巢穴"] = {
 		["key_name"]=[[赤月巢穴]],
		["checkmapid"]=[[抉择之地]], 
	},
	["霸者大厅"] = {
 		["key_name"]=[[霸者大厅]],
		["checkmapid"]=[[霸者大厅]], 
	},
	["幽冥回廊"] = {
 		["key_name"]=[[幽冥回廊]],
		["checkmapid"]=[[霸者大厅]], 
	},
	["纵横道"] = {
 		["key_name"]=[[纵横道]],
		["checkmapid"]=[[霸者大厅]], 
	},
	["魔魂殿"] = {
 		["key_name"]=[[魔魂殿]],
		["checkmapid"]=[[霸者大厅]], 
	},
	["炼狱回廊"] = {
 		["key_name"]=[[炼狱回廊]],
		["checkmapid"]=[[霸者大厅]], 
	},
	["封魔神殿"] = {
 		["key_name"]=[[封魔神殿]],
		["checkmapid"]=[[霸者大厅]], 
	},
	["牛魔寺庙一层"] = {
 		["key_name"]=[[牛魔寺庙一层]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["牛魔寺庙二层"] = {
 		["key_name"]=[[牛魔寺庙二层]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["牛魔寺庙三层"] = {
 		["key_name"]=[[牛魔寺庙三层]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["牛魔寺庙四层"] = {
 		["key_name"]=[[牛魔寺庙四层]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["牛魔寺庙五层"] = {
 		["key_name"]=[[牛魔寺庙五层]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["牛魔寺庙六层"] = {
 		["key_name"]=[[牛魔寺庙六层]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["牛魔寺庙大殿"] = {
 		["key_name"]=[[牛魔寺庙大殿]],
		["checkmapid"]=[[牛魔寺庙一层]], 
	},
	["尸魔洞穴一层"] = {
 		["key_name"]=[[尸魔洞穴一层]],
		["checkmapid"]=[[尸魔洞穴一层]], 
	},
	["尸魔洞穴二层"] = {
 		["key_name"]=[[尸魔洞穴二层]],
		["checkmapid"]=[[尸魔洞穴一层]], 
	},
	["尸魔洞穴三层"] = {
 		["key_name"]=[[尸魔洞穴三层]],
		["checkmapid"]=[[尸魔洞穴一层]], 
	},
	["尸魔洞穴四层"] = {
 		["key_name"]=[[尸魔洞穴四层]],
		["checkmapid"]=[[尸魔洞穴一层]], 
	},
	["尸魔洞穴五层"] = {
 		["key_name"]=[[尸魔洞穴五层]],
		["checkmapid"]=[[尸魔洞穴一层]], 
	},
	["尸魔巢穴"] = {
 		["key_name"]=[[尸魔巢穴]],
		["checkmapid"]=[[尸魔洞穴一层]], 
	},
	["骨魔石窟一层"] = {
 		["key_name"]=[[骨魔石窟一层]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["骨魔石窟二层"] = {
 		["key_name"]=[[骨魔石窟二层]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["骨魔石窟三层"] = {
 		["key_name"]=[[骨魔石窟三层]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["骨魔石窟四层"] = {
 		["key_name"]=[[骨魔石窟四层]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["骨魔石窟五层"] = {
 		["key_name"]=[[骨魔石窟五层]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["骨魔石窟六层"] = {
 		["key_name"]=[[骨魔石窟六层]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["骨魔坟场"] = {
 		["key_name"]=[[骨魔坟场]],
		["checkmapid"]=[[骨魔石窟一层]], 
	},
	["沙影之道一层"] = {
 		["key_name"]=[[沙影之道一层]],
		["checkmapid"]=[[沙影之道一层]], 
	},
	["沙影之道二层"] = {
 		["key_name"]=[[沙影之道二层]],
		["checkmapid"]=[[沙影之道一层]], 
	},
	["沙影之道三层"] = {
 		["key_name"]=[[沙影之道三层]],
		["checkmapid"]=[[沙影之道一层]], 
	},
	["沙影之道四层"] = {
 		["key_name"]=[[沙影之道四层]],
		["checkmapid"]=[[沙影之道一层]], 
	},
	["沙藏宝阁"] = {
 		["key_name"]=[[沙藏宝阁]],
		["checkmapid"]=[[沙影之道一层]], 
	},
	["未知暗殿一层"] = {
 		["key_name"]=[[未知暗殿一层]],
		["checkmapid"]=[[未知暗殿一层]], 
	},
	["未知暗殿二层"] = {
 		["key_name"]=[[未知暗殿二层]],
		["checkmapid"]=[[未知暗殿一层]], 
	},
	["未知暗殿"] = {
 		["key_name"]=[[未知暗殿]],
		["checkmapid"]=[[未知暗殿一层]], 
	},
	["王者禁地一层"] = {
 		["key_name"]=[[王者禁地一层]],
		["checkmapid"]=[[王者禁地一层]], 
	},
	["王者禁地二层"] = {
 		["key_name"]=[[王者禁地二层]],
		["checkmapid"]=[[王者禁地一层]], 
	},
	["王者禁地"] = {
 		["key_name"]=[[王者禁地]],
		["checkmapid"]=[[王者禁地一层]], 
	},
	["圣域之门一层"] = {
 		["key_name"]=[[圣域之门一层]],
		["checkmapid"]=[[圣域之门一层]], 
	},
	["圣域之门二层"] = {
 		["key_name"]=[[圣域之门二层]],
		["checkmapid"]=[[圣域之门一层]], 
	},
	["圣域之门"] = {
 		["key_name"]=[[圣域之门]],
		["checkmapid"]=[[圣域之门一层]], 
	},
	["玛雅神殿一层"] = {
 		["key_name"]=[[玛雅神殿一层]],
		["checkmapid"]=[[玛雅神殿一层]], 
	},
	["玛雅神殿二层"] = {
 		["key_name"]=[[玛雅神殿二层]],
		["checkmapid"]=[[玛雅神殿一层]], 
	},
	["玛雅神殿"] = {
 		["key_name"]=[[玛雅神殿]],
		["checkmapid"]=[[玛雅神殿一层]], 
	},
	["炼狱禁地一层"] = {
 		["key_name"]=[[炼狱禁地一层]],
		["checkmapid"]=[[炼狱禁地一层]], 
	},
	["炼狱禁地二层"] = {
 		["key_name"]=[[炼狱禁地二层]],
		["checkmapid"]=[[炼狱禁地一层]], 
	},
	["炼狱禁地三层"] = {
 		["key_name"]=[[炼狱禁地三层]],
		["checkmapid"]=[[炼狱禁地一层]], 
	},
	["炼狱禁地"] = {
 		["key_name"]=[[炼狱禁地]],
		["checkmapid"]=[[炼狱禁地一层]], 
	},
	["堕落魔域一层"] = {
 		["key_name"]=[[堕落魔域一层]],
		["checkmapid"]=[[堕落魔域一层]], 
	},
	["堕落魔域二层"] = {
 		["key_name"]=[[堕落魔域二层]],
		["checkmapid"]=[[堕落魔域一层]], 
	},
	["堕落魔域三层"] = {
 		["key_name"]=[[堕落魔域三层]],
		["checkmapid"]=[[堕落魔域一层]], 
	},
	["堕落魔域"] = {
 		["key_name"]=[[堕落魔域]],
		["checkmapid"]=[[堕落魔域一层]], 
	},
	["琅琊宝阁一层"] = {
 		["key_name"]=[[琅琊宝阁一层]],
		["checkmapid"]=[[琅琊宝阁一层]], 
	},
	["琅琊宝阁二层"] = {
 		["key_name"]=[[琅琊宝阁二层]],
		["checkmapid"]=[[琅琊宝阁一层]], 
	},
	["琅琊宝阁"] = {
 		["key_name"]=[[琅琊宝阁]],
		["checkmapid"]=[[琅琊宝阁一层]], 
	},
	["幽冥圣地一层"] = {
 		["key_name"]=[[幽冥圣地一层]],
		["checkmapid"]=[[幽冥圣地一层]], 
	},
	["幽冥圣地二层"] = {
 		["key_name"]=[[幽冥圣地二层]],
		["checkmapid"]=[[幽冥圣地一层]], 
	},
	["幽冥圣地"] = {
 		["key_name"]=[[幽冥圣地]],
		["checkmapid"]=[[幽冥圣地一层]], 
	},
	["情缘峡谷一层"] = {
 		["key_name"]=[[情缘峡谷一层]],
		["checkmapid"]=[[情缘峡谷一层]], 
	},
	["情缘峡谷二层"] = {
 		["key_name"]=[[情缘峡谷二层]],
		["checkmapid"]=[[情缘峡谷一层]], 
	},
	["情缘峡谷"] = {
 		["key_name"]=[[情缘峡谷]],
		["checkmapid"]=[[情缘峡谷一层]], 
	},
	["蚂蚁巢穴"] = {
 		["key_name"]=[[蚂蚁巢穴]],
		["checkmapid"]=[[蚂蚁巢穴]], 
	},
	["蚂蚁巢穴二"] = {
 		["key_name"]=[[蚂蚁巢穴二]],
		["checkmapid"]=[[蚂蚁巢穴]], 
	},
	["蚂蚁巢穴三"] = {
 		["key_name"]=[[蚂蚁巢穴三]],
		["checkmapid"]=[[蚂蚁巢穴]], 
	},
	["真天魔宫"] = {
 		["key_name"]=[[真天魔宫]],
		["checkmapid"]=[[真天魔宫]], 
	},
	["真天魔宫二"] = {
 		["key_name"]=[[真天魔宫二]],
		["checkmapid"]=[[真天魔宫]], 
	},
	["真天魔宫三"] = {
 		["key_name"]=[[真天魔宫三]],
		["checkmapid"]=[[真天魔宫]], 
	},
	["真天宫殿"] = {
 		["key_name"]=[[真天宫殿]],
		["checkmapid"]=[[真天魔宫]], 
	},
	["黑度神殿"] = {
 		["key_name"]=[[黑度神殿]],
		["checkmapid"]=[[黑度神殿]], 
	},
	["黑度神殿二"] = {
 		["key_name"]=[[黑度神殿二]],
		["checkmapid"]=[[黑度神殿]], 
	},
	["黑度神殿三"] = {
 		["key_name"]=[[黑度神殿三]],
		["checkmapid"]=[[黑度神殿]], 
	},
	["黑度神殿四"] = {
 		["key_name"]=[[黑度神殿四]],
		["checkmapid"]=[[黑度神殿]], 
	},
	["月光村落"] = {
 		["key_name"]=[[月光村落]],
		["checkmapid"]=[[月光村落]], 
	},
	["月光森林"] = {
 		["key_name"]=[[月光森林]],
		["checkmapid"]=[[月光村落]], 
	},
	["月光水城"] = {
 		["key_name"]=[[月光水城]],
		["checkmapid"]=[[月光村落]], 
	},
	["修罗禁地"] = {
 		["key_name"]=[[修罗禁地]],
		["checkmapid"]=[[修罗禁地]], 
	},
	["修罗禁地二"] = {
 		["key_name"]=[[修罗禁地二]],
		["checkmapid"]=[[修罗禁地]], 
	},
	["修罗禁地三"] = {
 		["key_name"]=[[修罗禁地三]],
		["checkmapid"]=[[修罗禁地]], 
	},
	["幽灵船1"] = {
 		["key_name"]=[[幽灵船1]],
		["checkmapid"]=[[幽灵船1]], 
	},
	["幽灵船2"] = {
 		["key_name"]=[[幽灵船2]],
		["checkmapid"]=[[幽灵船1]], 
	},
	["幽灵船3"] = {
 		["key_name"]=[[幽灵船3]],
		["checkmapid"]=[[幽灵船1]], 
	},
	["幽灵船4"] = {
 		["key_name"]=[[幽灵船4]],
		["checkmapid"]=[[幽灵船1]], 
	},
	["幽灵船5"] = {
 		["key_name"]=[[幽灵船5]],
		["checkmapid"]=[[幽灵船1]], 
	},
	["幽灵船6"] = {
 		["key_name"]=[[幽灵船6]],
		["checkmapid"]=[[幽灵船1]], 
	},
	["火龙洞1"] = {
 		["key_name"]=[[火龙洞1]],
		["checkmapid"]=[[火龙洞1]], 
	},
	["火龙洞2"] = {
 		["key_name"]=[[火龙洞2]],
		["checkmapid"]=[[火龙洞1]], 
	},
	["火龙洞3"] = {
 		["key_name"]=[[火龙洞3]],
		["checkmapid"]=[[火龙洞1]], 
	},
	["火龙洞4"] = {
 		["key_name"]=[[火龙洞4]],
		["checkmapid"]=[[火龙洞1]], 
	},
	["火龙洞5"] = {
 		["key_name"]=[[火龙洞5]],
		["checkmapid"]=[[火龙洞1]], 
	},
	["雷炎洞窟1"] = {
 		["key_name"]=[[雷炎洞窟1]],
		["checkmapid"]=[[雷炎洞窟1]], 
	},
	["雷炎洞窟2"] = {
 		["key_name"]=[[雷炎洞窟2]],
		["checkmapid"]=[[雷炎洞窟1]], 
	},
	["雷炎洞窟3"] = {
 		["key_name"]=[[雷炎洞窟3]],
		["checkmapid"]=[[雷炎洞窟1]], 
	},
	["雷炎洞窟4"] = {
 		["key_name"]=[[雷炎洞窟4]],
		["checkmapid"]=[[雷炎洞窟1]], 
	},
	["雷炎洞窟5"] = {
 		["key_name"]=[[雷炎洞窟5]],
		["checkmapid"]=[[雷炎洞窟1]], 
	},
	["雷炎洞窟6"] = {
 		["key_name"]=[[雷炎洞窟6]],
		["checkmapid"]=[[雷炎洞窟1]], 
	},
	["雪域山谷"] = {
 		["key_name"]=[[雪域山谷]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域宫殿一"] = {
 		["key_name"]=[[雪域宫殿一]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域宫殿四"] = {
 		["key_name"]=[[雪域宫殿四]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域宫殿五"] = {
 		["key_name"]=[[雪域宫殿五]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域宫殿六"] = {
 		["key_name"]=[[雪域宫殿六]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域迷宫1"] = {
 		["key_name"]=[[雪域迷宫1]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域迷宫2"] = {
 		["key_name"]=[[雪域迷宫2]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域迷宫3"] = {
 		["key_name"]=[[雪域迷宫3]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域迷宫4"] = {
 		["key_name"]=[[雪域迷宫4]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域迷宫5"] = {
 		["key_name"]=[[雪域迷宫5]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域迷宫6"] = {
 		["key_name"]=[[雪域迷宫6]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域王座"] = {
 		["key_name"]=[[雪域王座]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["雪域星宫"] = {
 		["key_name"]=[[雪域星宫]],
		["checkmapid"]=[[雪域山谷]], 
	},
	["诺玛沙漠"] = {
 		["key_name"]=[[诺玛沙漠]],
		["checkmapid"]=[[诺玛沙漠]], 
	},
	["诺玛沙漠西郊"] = {
 		["key_name"]=[[诺玛沙漠西郊]],
		["checkmapid"]=[[诺玛沙漠]], 
	},
	["诺玛沙漠荒原"] = {
 		["key_name"]=[[诺玛沙漠荒原]],
		["checkmapid"]=[[诺玛沙漠]], 
	},
	["诺玛沙漠祭坛"] = {
 		["key_name"]=[[诺玛沙漠祭坛]],
		["checkmapid"]=[[诺玛沙漠]], 
	},
	["诺玛沙漠沼泽"] = {
 		["key_name"]=[[诺玛沙漠沼泽]],
		["checkmapid"]=[[诺玛沙漠]], 
	},
	["诺玛沙漠古城"] = {
 		["key_name"]=[[诺玛沙漠古城]],
		["checkmapid"]=[[诺玛沙漠]], 
	},
	["巫妖森林"] = {
 		["key_name"]=[[巫妖森林]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林1"] = {
 		["key_name"]=[[巫妖森林1]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林2"] = {
 		["key_name"]=[[巫妖森林2]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林3"] = {
 		["key_name"]=[[巫妖森林3]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林4"] = {
 		["key_name"]=[[巫妖森林4]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林5"] = {
 		["key_name"]=[[巫妖森林5]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林6"] = {
 		["key_name"]=[[巫妖森林6]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林7"] = {
 		["key_name"]=[[巫妖森林7]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["巫妖森林8"] = {
 		["key_name"]=[[巫妖森林8]],
		["checkmapid"]=[[巫妖森林]], 
	},
	["镇魂魔棺"] = {
 		["key_name"]=[[镇魂魔棺]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺1"] = {
 		["key_name"]=[[镇魂魔棺1]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺2"] = {
 		["key_name"]=[[镇魂魔棺2]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺3"] = {
 		["key_name"]=[[镇魂魔棺3]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺4"] = {
 		["key_name"]=[[镇魂魔棺4]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺5"] = {
 		["key_name"]=[[镇魂魔棺5]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺6"] = {
 		["key_name"]=[[镇魂魔棺6]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺7"] = {
 		["key_name"]=[[镇魂魔棺7]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["镇魂魔棺8"] = {
 		["key_name"]=[[镇魂魔棺8]],
		["checkmapid"]=[[镇魂魔棺]], 
	},
	["冰霜峡谷"] = {
 		["key_name"]=[[冰霜峡谷]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷1"] = {
 		["key_name"]=[[冰霜峡谷1]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷2"] = {
 		["key_name"]=[[冰霜峡谷2]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷3"] = {
 		["key_name"]=[[冰霜峡谷3]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷4"] = {
 		["key_name"]=[[冰霜峡谷4]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷5"] = {
 		["key_name"]=[[冰霜峡谷5]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷6"] = {
 		["key_name"]=[[冰霜峡谷6]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷7"] = {
 		["key_name"]=[[冰霜峡谷7]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["冰霜峡谷8"] = {
 		["key_name"]=[[冰霜峡谷8]],
		["checkmapid"]=[[冰霜峡谷]], 
	},
	["十殿阎罗"] = {
 		["key_name"]=[[十殿阎罗]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗1"] = {
 		["key_name"]=[[十殿阎罗1]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗2"] = {
 		["key_name"]=[[十殿阎罗2]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗3"] = {
 		["key_name"]=[[十殿阎罗3]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗4"] = {
 		["key_name"]=[[十殿阎罗4]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗5"] = {
 		["key_name"]=[[十殿阎罗5]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗6"] = {
 		["key_name"]=[[十殿阎罗6]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗7"] = {
 		["key_name"]=[[十殿阎罗7]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗8"] = {
 		["key_name"]=[[十殿阎罗8]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗9"] = {
 		["key_name"]=[[十殿阎罗9]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["十殿阎罗10"] = {
 		["key_name"]=[[十殿阎罗10]],
		["checkmapid"]=[[十殿阎罗]], 
	},
	["修罗黄泉"] = {
 		["key_name"]=[[修罗黄泉]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["修罗黄泉1"] = {
 		["key_name"]=[[修罗黄泉1]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["修罗黄泉2"] = {
 		["key_name"]=[[修罗黄泉2]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["修罗黄泉3"] = {
 		["key_name"]=[[修罗黄泉3]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["修罗黄泉4"] = {
 		["key_name"]=[[修罗黄泉4]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["修罗黄泉5"] = {
 		["key_name"]=[[修罗黄泉5]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["修罗黄泉6"] = {
 		["key_name"]=[[修罗黄泉6]],
		["checkmapid"]=[[修罗黄泉]], 
	},
	["无间地狱"] = {
 		["key_name"]=[[无间地狱]],
		["checkmapid"]=[[无间地狱]], 
	},
	["无间地狱1"] = {
 		["key_name"]=[[无间地狱1]],
		["checkmapid"]=[[无间地狱]], 
	},
	["无间地狱2"] = {
 		["key_name"]=[[无间地狱2]],
		["checkmapid"]=[[无间地狱]], 
	},
	["无间地狱3"] = {
 		["key_name"]=[[无间地狱3]],
		["checkmapid"]=[[无间地狱]], 
	},
	["无间地狱4"] = {
 		["key_name"]=[[无间地狱4]],
		["checkmapid"]=[[无间地狱]], 
	},
	["血海冥河"] = {
 		["key_name"]=[[血海冥河]],
		["checkmapid"]=[[血海冥河]], 
	},
	["血海冥河1"] = {
 		["key_name"]=[[血海冥河1]],
		["checkmapid"]=[[血海冥河]], 
	},
	["血海冥河2"] = {
 		["key_name"]=[[血海冥河2]],
		["checkmapid"]=[[血海冥河]], 
	},
	["血海冥河3"] = {
 		["key_name"]=[[血海冥河3]],
		["checkmapid"]=[[血海冥河]], 
	},
	["血海冥河4"] = {
 		["key_name"]=[[血海冥河4]],
		["checkmapid"]=[[血海冥河]], 
	},
	["天空魔域"] = {
 		["key_name"]=[[天空魔域]],
		["checkmapid"]=[[天空魔域]], 
	},
	["天空魔域1"] = {
 		["key_name"]=[[天空魔域1]],
		["checkmapid"]=[[天空魔域]], 
	},
	["天空魔域2"] = {
 		["key_name"]=[[天空魔域2]],
		["checkmapid"]=[[天空魔域]], 
	},
	["天空魔域3"] = {
 		["key_name"]=[[天空魔域3]],
		["checkmapid"]=[[天空魔域]], 
	},
	["天空魔域4"] = {
 		["key_name"]=[[天空魔域4]],
		["checkmapid"]=[[天空魔域]], 
	},
	["鲁王神殿"] = {
 		["key_name"]=[[鲁王神殿]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["鲁王神殿1"] = {
 		["key_name"]=[[鲁王神殿1]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["鲁王神殿2"] = {
 		["key_name"]=[[鲁王神殿2]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["鲁王神殿3"] = {
 		["key_name"]=[[鲁王神殿3]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["鲁王神殿4"] = {
 		["key_name"]=[[鲁王神殿4]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["鲁王神殿5"] = {
 		["key_name"]=[[鲁王神殿5]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["鲁王神殿6"] = {
 		["key_name"]=[[鲁王神殿6]],
		["checkmapid"]=[[鲁王神殿]], 
	},
	["云顶天宫"] = {
 		["key_name"]=[[云顶天宫]],
		["checkmapid"]=[[云顶天宫]], 
	},
	["云顶天宫1"] = {
 		["key_name"]=[[云顶天宫1]],
		["checkmapid"]=[[云顶天宫]], 
	},
	["云顶天宫2"] = {
 		["key_name"]=[[云顶天宫2]],
		["checkmapid"]=[[云顶天宫]], 
	},
	["云顶天宫3"] = {
 		["key_name"]=[[云顶天宫3]],
		["checkmapid"]=[[云顶天宫]], 
	},
	["云顶天宫4"] = {
 		["key_name"]=[[云顶天宫4]],
		["checkmapid"]=[[云顶天宫]], 
	},
	["精绝古城"] = {
 		["key_name"]=[[精绝古城]],
		["checkmapid"]=[[精绝古城]], 
	},
	["精绝古城1"] = {
 		["key_name"]=[[精绝古城1]],
		["checkmapid"]=[[精绝古城]], 
	},
	["精绝古城2"] = {
 		["key_name"]=[[精绝古城2]],
		["checkmapid"]=[[精绝古城]], 
	},
	["精绝古城3"] = {
 		["key_name"]=[[精绝古城3]],
		["checkmapid"]=[[精绝古城]], 
	},
	["献王神庙"] = {
 		["key_name"]=[[献王神庙]],
		["checkmapid"]=[[献王神庙]], 
	},
	["献王神庙1"] = {
 		["key_name"]=[[献王神庙1]],
		["checkmapid"]=[[献王神庙]], 
	},
	["献王神庙2"] = {
 		["key_name"]=[[献王神庙2]],
		["checkmapid"]=[[献王神庙]], 
	},
	["献王神庙3"] = {
 		["key_name"]=[[献王神庙3]],
		["checkmapid"]=[[献王神庙]], 
	},
	["风暴壁垒"] = {
 		["key_name"]=[[风暴壁垒]],
		["checkmapid"]=[[风暴壁垒]], 
	},
	["风暴壁垒1"] = {
 		["key_name"]=[[风暴壁垒1]],
		["checkmapid"]=[[风暴壁垒]], 
	},
	["龙柩地宫"] = {
 		["key_name"]=[[龙柩地宫]],
		["checkmapid"]=[[龙柩地宫]], 
	},
	["龙柩地宫1"] = {
 		["key_name"]=[[龙柩地宫1]],
		["checkmapid"]=[[龙柩地宫]], 
	},
	["遗忘书冢"] = {
 		["key_name"]=[[遗忘书冢]],
		["checkmapid"]=[[遗忘书冢]], 
	},
	["遗忘书冢1"] = {
 		["key_name"]=[[遗忘书冢1]],
		["checkmapid"]=[[遗忘书冢]], 
	},
	["星璇迷宫"] = {
 		["key_name"]=[[星璇迷宫]],
		["checkmapid"]=[[星璇迷宫]], 
	},
	["星璇迷宫1"] = {
 		["key_name"]=[[星璇迷宫1]],
		["checkmapid"]=[[星璇迷宫]], 
	},
	["毒龙深渊"] = {
 		["key_name"]=[[毒龙深渊]],
		["checkmapid"]=[[毒龙深渊]], 
	},
	["毒龙深渊1"] = {
 		["key_name"]=[[毒龙深渊1]],
		["checkmapid"]=[[毒龙深渊]], 
	},
	["巫祭禁地"] = {
 		["key_name"]=[[巫祭禁地]],
		["checkmapid"]=[[巫祭禁地]], 
	},
	["巫祭禁地1"] = {
 		["key_name"]=[[巫祭禁地1]],
		["checkmapid"]=[[巫祭禁地]], 
	},
	["瘴雾沼泽"] = {
 		["key_name"]=[[瘴雾沼泽]],
		["checkmapid"]=[[瘴雾沼泽]], 
	},
	["瘴雾沼泽1"] = {
 		["key_name"]=[[瘴雾沼泽1]],
		["checkmapid"]=[[瘴雾沼泽]], 
	},
	["冰晶回廊"] = {
 		["key_name"]=[[冰晶回廊]],
		["checkmapid"]=[[冰晶回廊]], 
	},
	["冰晶回廊1"] = {
 		["key_name"]=[[冰晶回廊1]],
		["checkmapid"]=[[冰晶回廊]], 
	},
	["遗骸禁区"] = {
 		["key_name"]=[[遗骸禁区]],
		["checkmapid"]=[[遗骸禁区]], 
	},
	["遗骸禁区1"] = {
 		["key_name"]=[[遗骸禁区1]],
		["checkmapid"]=[[遗骸禁区]], 
	},
	["潘夜神殿"] = {
 		["key_name"]=[[潘夜神殿]],
		["checkmapid"]=[[潘夜神殿]], 
	},
	["流放之地"] = {
 		["key_name"]=[[流放之地]],
		["checkmapid"]=[[流放之地]], 
	},
	["遗落绝境"] = {
 		["key_name"]=[[遗落绝境]],
		["checkmapid"]=[[遗落绝境]], 
	},
	["风暴禁地"] = {
 		["key_name"]=[[风暴禁地]],
		["checkmapid"]=[[风暴禁地]], 
	},
	["风暴血渊"] = {
 		["key_name"]=[[风暴血渊]],
		["checkmapid"]=[[风暴血渊]], 
	},
	["风暴神庙"] = {
 		["key_name"]=[[风暴神庙]],
		["checkmapid"]=[[风暴神庙]], 
	},
	["风暴地牢"] = {
 		["key_name"]=[[风暴地牢]],
		["checkmapid"]=[[风暴地牢]], 
	},
	["风暴山谷"] = {
 		["key_name"]=[[风暴山谷]],
		["checkmapid"]=[[风暴山谷]], 
	},
	["雪原峡谷"] = {
 		["key_name"]=[[雪原峡谷]],
		["checkmapid"]=[[雪原峡谷]], 
	},
	["雪原密道"] = {
 		["key_name"]=[[雪原密道]],
		["checkmapid"]=[[雪原密道]], 
	},
	["雪原宫殿"] = {
 		["key_name"]=[[雪原宫殿]],
		["checkmapid"]=[[雪原宫殿]], 
	},
	["雪原古堡"] = {
 		["key_name"]=[[雪原古堡]],
		["checkmapid"]=[[雪原古堡]], 
	},
	["蛮荒血域"] = {
 		["key_name"]=[[蛮荒血域]],
		["checkmapid"]=[[蛮荒血域]], 
	},
	["蛮荒荒漠"] = {
 		["key_name"]=[[蛮荒荒漠]],
		["checkmapid"]=[[蛮荒荒漠]], 
	},
	["蛮荒古城"] = {
 		["key_name"]=[[蛮荒古城]],
		["checkmapid"]=[[蛮荒古城]], 
	},
	["蛮荒神庙"] = {
 		["key_name"]=[[蛮荒神庙]],
		["checkmapid"]=[[蛮荒神庙]], 
	},
	["蛮荒暗殿"] = {
 		["key_name"]=[[蛮荒暗殿]],
		["checkmapid"]=[[蛮荒暗殿]], 
	},
	["蛮荒森林"] = {
 		["key_name"]=[[蛮荒森林]],
		["checkmapid"]=[[蛮荒森林]], 
	},  
}
 return config;