---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["tips"]=[[每10分钟开启一次]],
		["progress"]=10,
		["time"]=10,
		["desc"]=[[免费开启]], 
	},
	[2] = {
 		["key_name"]=2,
		["tips"]=[[击杀任意小怪500只]],
		["progress"]=500,
		["time"]=10,
		["desc"]=[[小怪]], 
	},
	[3] = {
 		["key_name"]=3,
		["tips"]=[[击杀任意绿怪100只]],
		["progress"]=100,
		["time"]=10,
		["desc"]=[[绿怪]], 
	},
	[4] = {
 		["key_name"]=4,
		["tips"]=[[击杀任意粉怪30只]],
		["progress"]=30,
		["time"]=10,
		["desc"]=[[粉怪]], 
	},
	["免费开启"] = {
 		["key_name"]=[[免费开启]],
		["giveitem"]=[[绑定元宝#1000#1000|绑定元宝#1500#500|绑定元宝#2000#300|绑定元宝#2500#200|绑定元宝#3000#100]], 
	},
	["小怪"] = {
 		["key_name"]=[[小怪]],
		["giveitem"]=[[绑定元宝#1000#1000|绑定元宝#1500#500|绑定元宝#2000#300|绑定元宝#2500#200|绑定元宝#3000#100|100万经验珠#1#500|1000万经验珠#1#300|书页#3#200|黑铁#10#200|龙鳞#10#200]], 
	},
	["绿怪"] = {
 		["key_name"]=[[绿怪]],
		["giveitem"]=[[绑定元宝#1000#1000|绑定元宝#2000#300|绑定元宝#3000#100|100万经验珠#3#500|1000万经验珠#2#300|书页#10#200|黑铁#10#200|龙鳞#10#200|五行精华#10#200|玛法宝典#1#10]], 
	},
	["粉怪"] = {
 		["key_name"]=[[粉怪]],
		["giveitem"]=[[绑定元宝#3000#100|100万经验珠#3#500|1000万经验珠#2#300|书页#10#200|黑铁#10#200|龙鳞#10#200|五行精华#10#200|罗盘#1#50|万能恶魔图鉴#1#20|神器魔盒#1#10]], 
	},  
}
 return config;