---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["初级材料礼盒"] = {
 		["key_name"]=[[初级材料礼盒]],
		["item"]=[[生肖精华#18|斗笠精华#58|勋章精华#58|护符精华#58|军鼓精华#58|血石精华#58]],
		["var"]=1, 
	},
	["中级材料礼盒"] = {
 		["key_name"]=[[中级材料礼盒]],
		["item"]=[[生肖精华#36|斗笠精华#128|勋章精华#128|护符精华#128|军鼓精华#128|血石精华#128]],
		["var"]=1, 
	},
	["高级材料礼盒"] = {
 		["key_name"]=[[高级材料礼盒]],
		["item"]=[[生肖精华#72|斗笠精华#256|勋章精华#256|护符精华#256|军鼓精华#256|血石精华#256]],
		["var"]=1, 
	},
	["特级材料礼盒"] = {
 		["key_name"]=[[特级材料礼盒]],
		["item"]=[[生肖精华#72|斗笠精华#512|勋章精华#512|护符精华#512|军鼓精华#512|血石精华#512]],
		["var"]=1, 
	},
	["初级时装礼盒"] = {
 		["key_name"]=[[初级时装礼盒]],
		["item"]="[时装激活卡]街头小子#1|[时装激活卡]大白兔#1|[时装激活卡]我还是个宝宝#1|[时装激活卡]幽灵盗贼#1|[时装激活卡]亡灵死神#1|[时装激活卡]地狱守卫#1|[时装激活卡]黄金卫士#1|[时装激活卡]暗影剑圣#1",
		["var"]=1, 
	},
	["高级时装礼盒"] = {
 		["key_name"]=[[高级时装礼盒]],
		["item"]="[时装激活卡]兽人王#1|[时装激活卡]忍者#1|[时装激活卡]姜子牙#1|[时装激活卡]亡灵女妖#1|[时装激活卡]鬼武者#1|[时装激活卡]黄金战神#1|[时装激活卡]李逍遥#1|[时装激活卡]锦衣卫#1",
		["var"]=1, 
	},
	["史诗时装礼盒"] = {
 		["key_name"]=[[史诗时装礼盒]],
		["item"]="[时装激活卡]橘右京#1|[时装激活卡]关二爷#1|[时装激活卡]孙行者#1|[时装激活卡]浪客剑心#1|[时装激活卡]执法者#1|[时装激活卡]双头金刚#1|[时装激活卡]斗战胜佛#1|[时装激活卡]三太子#1",
		["var"]=1, 
	},
	["传说时装礼盒"] = {
 		["key_name"]=[[传说时装礼盒]],
		["item"]="[时装激活卡]战神吕布#1|[时装激活卡]紫霞仙子#1|[时装激活卡]龙骑士#1|[时装激活卡]魔王撒旦#1|[时装激活卡]精灵#1|[时装激活卡]地府判官#1|[时装激活卡]無双飞将#1|[时装激活卡]海王#1",
		["var"]=1, 
	},
	["初级坐骑礼盒"] = {
 		["key_name"]=[[初级坐骑礼盒]],
		["item"]="[坐骑激活卡]白衣剑仙#1",
		["var"]=1, 
	},
	["高级坐骑礼盒"] = {
 		["key_name"]=[[高级坐骑礼盒]],
		["item"]="[坐骑激活卡]流浪侠客#1",
		["var"]=1, 
	},
	["史诗坐骑礼盒"] = {
 		["key_name"]=[[史诗坐骑礼盒]],
		["item"]="[坐骑激活卡]飞将军#1",
		["var"]=1, 
	},
	["传说坐骑礼盒"] = {
 		["key_name"]=[[传说坐骑礼盒]],
		["item"]="[坐骑激活卡]武圣将军#1|[坐骑激活卡]常山子龙#1",
		["var"]=1, 
	},
	["初级足迹礼盒"] = {
 		["key_name"]=[[初级足迹礼盒]],
		["item"]="[足迹激活卡]金榜题名#1|[足迹激活卡]财运滚滚#1|[足迹激活卡]花开四季#1|[足迹激活卡]步步生金#1|[足迹激活卡]六六大顺#1",
		["var"]=1, 
	},
	["高级足迹礼盒"] = {
 		["key_name"]=[[高级足迹礼盒]],
		["item"]="[足迹激活卡]五彩缤纷#1|[足迹激活卡]疾如风#1|[足迹激活卡]礼花炮#1|[足迹激活卡]水生财#1|[足迹激活卡]南瓜头#1",
		["var"]=1, 
	},
	["史诗足迹礼盒"] = {
 		["key_name"]=[[史诗足迹礼盒]],
		["item"]="[足迹激活卡]小金龙#1|[足迹激活卡]月如意#1|[足迹激活卡]大鸡大利#1|[足迹激活卡]星光灿烂#1|[足迹激活卡]纯爱战士#1",
		["var"]=1, 
	},
	["传说足迹礼盒"] = {
 		["key_name"]=[[传说足迹礼盒]],
		["item"]="[足迹激活卡]挥金如土#1|[足迹激活卡]地狱火#1|[足迹激活卡]火麒麟#1|[足迹激活卡]恶魔泪#1|[足迹激活卡]雪莲花#1|[足迹激活卡]杀破狼#1|[足迹激活卡]紫气东来#1",
		["var"]=1, 
	},
	["初级魂环礼盒"] = {
 		["key_name"]=[[初级魂环礼盒]],
		["item"]="虚空魂环[激活卡]#1|雷鸣魂环[激活卡]#1|冰霜魂环[激活卡]#1",
		["var"]=1, 
	},
	["高级魂环礼盒"] = {
 		["key_name"]=[[高级魂环礼盒]],
		["item"]="乾坤魂环[激活卡]#1|九幽魂环[激活卡]#1|星辰魂环[激活卡]#1",
		["var"]=1, 
	},
	["史诗魂环礼盒"] = {
 		["key_name"]=[[史诗魂环礼盒]],
		["item"]="归墟魂环[激活卡]#1|时空魂环[激活卡]#1|血狱魂环[激活卡]#1",
		["var"]=1, 
	},
	["传说魂环礼盒"] = {
 		["key_name"]=[[传说魂环礼盒]],
		["item"]="龙炎魂环[激活卡]#1|道法魂环[激活卡]#1|圣天魂环[激活卡]#1",
		["var"]=1, 
	},
	["初级宠物礼盒"] = {
 		["key_name"]=[[初级宠物礼盒]],
		["item"]="[宠物激活卡]金龙#1|[宠物激活卡]火鸟#1",
		["var"]=1, 
	},
	["高级宠物礼盒"] = {
 		["key_name"]=[[高级宠物礼盒]],
		["item"]="[宠物激活卡]麒麟#1|[宠物激活卡]鹿仙#1",
		["var"]=1, 
	},
	["史诗宠物礼盒"] = {
 		["key_name"]=[[史诗宠物礼盒]],
		["item"]="[宠物激活卡]朱雀#1|[宠物激活卡]凤凰#1",
		["var"]=1, 
	},
	["传说宠物礼盒"] = {
 		["key_name"]=[[传说宠物礼盒]],
		["item"]="[宠物激活卡]狐妖#1|[宠物激活卡]蛇王#1|[宠物激活卡]妖王#1|[宠物激活卡]汪星人#1",
		["var"]=1, 
	},
	["70级首饰自选宝箱"] = {
 		["key_name"]=[[70级首饰自选宝箱]],
		["item"]=[[刑天战盔#1|刑天战链#1|刑天战镯#1|刑天战戒#1|刑天战带#1|刑天战靴#1|祝融法盔#1|祝融法链#1|祝融法镯#1|祝融法戒#1|祝融法带#1|祝融法靴#1|阴阳道盔#1|阴阳道链#1|阴阳道镯#1|阴阳道戒#1|阴阳道带#1|阴阳道靴#1]],
		["var"]=1, 
	},
	["75级首饰自选宝箱"] = {
 		["key_name"]=[[75级首饰自选宝箱]],
		["item"]=[[天赐战盔#1|天赐战链#1|天赐战镯#1|天赐战戒#1|天赐战带#1|天赐战靴#1|麒麟魔盔#1|麒麟魔链#1|麒麟魔镯#1|麒麟魔戒#1|麒麟魔带#1|麒麟魔靴#1|无极道盔#1|无极道链#1|无极道镯#1|无极道戒#1|无极道带#1|无极道靴#1]],
		["var"]=1, 
	},
	["80级首饰自选宝箱"] = {
 		["key_name"]=[[80级首饰自选宝箱]],
		["item"]=[[龙吟战盔#1|龙吟战链#1|龙吟战镯#1|龙吟战戒#1|龙吟战带#1|龙吟战靴#1|修罗魔盔#1|修罗魔链#1|修罗魔镯#1|修罗魔戒#1|修罗魔带#1|修罗魔靴#1|仙风道盔#1|仙风道链#1|仙风道镯#1|仙风道戒#1|仙风道带#1|仙风道靴#1]],
		["var"]=1, 
	},
	["上古首饰自选宝箱"] = {
 		["key_name"]=[[上古首饰自选宝箱]],
		["item"]=[[啸天战盔#1|啸天战链#1|啸天战镯#1|啸天战戒#1|啸天战带#1|啸天战靴#1|暗月魔盔#1|暗月魔链#1|暗月魔镯#1|暗月魔戒#1|暗月魔带#1|暗月魔靴#1|太玄道盔#1|太玄道链#1|太玄道镯#1|太玄道戒#1|太玄道带#1|太玄道靴#1]],
		["var"]=1, 
	},
	["精英图鉴自选宝箱"] = {
 		["key_name"]=[[精英图鉴自选宝箱]],
		["item"]=[[【图鉴】半兽统领#1|【图鉴】尸王#1|【图鉴】石墓尸王#1|【图鉴】邪恶钳虫#1|【图鉴】沃玛卫士#1|【图鉴】白野猪#1|【图鉴】邪恶毒蛇#1|【图鉴】祖玛卫士#1|【图鉴】血巨人#1|【图鉴】千年树妖#1|【图鉴】牛魔将军#1|【图鉴】牛魔祭司#1|【图鉴】恶灵尸王#1|【图鉴】骷髅精灵王#1|【图鉴】电僵王#1|【图鉴】圣域蝎卫#1|【图鉴】圣域猪卫#1|【图鉴】圣域修罗#1|【图鉴】圣域魔魂#1|【图鉴】玛雅花吻#1|【图鉴】玛雅黑鳄#1|【图鉴】炼狱卫士#1|【图鉴】堕落祭司#1|【图鉴】堕落将军#1|【图鉴】琅琊尸王#1|【图鉴】圣地力士#1|【图鉴】圣地战将#1|【图鉴】圣地巨蛾#1|【图鉴】红衣法师#1|【图鉴】轻甲守卫#1|【图鉴】圣殿卫士#1|【图鉴】铁翼巨蛾#1|【图鉴】蓝背蜘蛛#1|【图鉴】蓝背天狼#1|【图鉴】雪域寒冰魔#1|【图鉴】雪域灭天魔#1|【图鉴】雪域五毒魔#1]],
		["var"]=1, 
	},
	["首领图鉴自选宝箱"] = {
 		["key_name"]=[[首领图鉴自选宝箱]],
		["item"]=[[【图鉴】兽王#1|【图鉴】万年尸王#1|【图鉴】触龙神#1|【图鉴】沃玛教主#1|【图鉴】野猪王#1|【图鉴】祖玛教主#1|【图鉴】双头血魔#1|【图鉴】双头金刚#1|【图鉴】赤月恶魔#1|【图鉴】虹魔教主#1|【图鉴】牛魔王#1|【图鉴】恶灵教主#1|【图鉴】黄泉教主#1|【图鉴】圣域血魔#1|【图鉴】圣域金刚#1|【图鉴】玛雅血魔#1|【图鉴】玛雅金刚#1|【图鉴】炼狱猪卫#1|【图鉴】炼狱蝎卫#1|【图鉴】峡谷电僵王#1|【图鉴】工蚁#1|【图鉴】真天守卫#1|【图鉴】黑度守卫#1|【图鉴】变异蚂蟥#1|【图鉴】修罗统领#1|【图鉴】幽灵守卫#1|【图鉴】狂热火蜥蜴#1|【图鉴】金杖蜘蛛#1|【图鉴】雪域天将#1|【图鉴】诺玛突击队长#1|【图鉴】诺玛侦察队长#1|【图鉴】邪灵巫妖#1|【图鉴】冥魂将军#1]],
		["var"]=1, 
	},
	["领主图鉴自选宝箱"] = {
 		["key_name"]=[[领主图鉴自选宝箱]],
		["item"]=[[【图鉴】沃玛领主#1|【图鉴】石墓领主#1|【图鉴】祖玛领主#1|【图鉴】血魔领主#1|【图鉴】金刚领主#1|【图鉴】虹魔领主#1|【图鉴】牛魔领主#1|【图鉴】恶灵领主#1|【图鉴】黄泉领主#1|【图鉴】禁地领主#1|【图鉴】圣域领主#1|【图鉴】玛雅领主#1|【图鉴】炼狱领主#1|【图鉴】堕落领主#1|【图鉴】琅琊领主#1|【图鉴】圣地领主#1|【图鉴】峡谷领主#1|【图鉴】蚁穴领主#1|【图鉴】真天领主#1|【图鉴】黑度领主#1|【图鉴】月光领主#1|【图鉴】修罗领主#1|【图鉴】幽灵领主#1|【图鉴】火龙领主#1|【图鉴】雷炎领主#1|【图鉴】雪域领主#1|【图鉴】诺玛领主#1]],
		["var"]=1, 
	},
	["霸主图鉴自选宝箱"] = {
 		["key_name"]=[[霸主图鉴自选宝箱]],
		["item"]=[[【图鉴】沃玛霸主#1|【图鉴】石墓霸主#1|【图鉴】祖玛霸主#1|【图鉴】赤月霸主#1|【图鉴】封魔霸主#1|【图鉴】牛魔霸主#1|【图鉴】恶灵霸主#1|【图鉴】黄泉霸主#1|【图鉴】禁地霸主#1|【图鉴】圣域霸主#1|【图鉴】玛雅霸主#1|【图鉴】炼狱霸主#1|【图鉴】堕落霸主#1|【图鉴】琅琊霸主#1|【图鉴】圣地霸主#1|【图鉴】峡谷霸主#1|【图鉴】蚁王霸主#1|【图鉴】真天霸主#1|【图鉴】黑度霸主#1|【图鉴】月光霸主#1|【图鉴】修罗霸主#1|【图鉴】幽灵霸主#1|【图鉴】火龙霸主#1|【图鉴】雷炎霸主#1|【图鉴】雪域霸主#1|【图鉴】诺玛霸主#1]],
		["var"]=1, 
	},
	["主宰图鉴自选宝箱"] = {
 		["key_name"]=[[主宰图鉴自选宝箱]],
		["item"]=[[【图鉴】地藏主宰#1|【图鉴】未知主宰#1|【图鉴】禁地主宰#1|【图鉴】圣域主宰#1|【图鉴】玛雅主宰#1|【图鉴】炼狱主宰#1|【图鉴】堕落主宰#1|【图鉴】琅琊主宰#1|【图鉴】圣地主宰#1|【图鉴】峡谷主宰#1|【图鉴】蚁后主宰#1|【图鉴】真天主宰#1|【图鉴】黑度主宰#1|【图鉴】月光主宰#1|【图鉴】修罗主宰#1|【图鉴】幽灵大主宰#1|【图鉴】火龙大主宰#1|【图鉴】雷炎大主宰#1|【图鉴】雪域大主宰#1|【图鉴】诺玛大主宰#1]],
		["var"]=1, 
	},
	["巨魔图鉴自选宝箱"] = {
 		["key_name"]=[[巨魔图鉴自选宝箱]],
		["item"]=[[【图鉴】巫妖巨魔#1|【图鉴】不朽巨魔#1|【图鉴】尸魄巨魔#1|【图鉴】夺命巨魔#1|【图鉴】磐石巨魔#1|【图鉴】咆哮巨魔#1|【图鉴】幽瞳巨魔#1|【图鉴】绝影巨魔#1|【图鉴】将臣巨魔#1|【图鉴】万尸巨魔#1|【图鉴】白骨巨魔#1|【图鉴】沙海巨魔#1]],
		["var"]=1, 
	},
	["泰坦图鉴自选宝箱"] = {
 		["key_name"]=[[泰坦图鉴自选宝箱]],
		["item"]=[[【图鉴】巫妖泰坦#1|【图鉴】幽冥泰坦#1|【图鉴】玄冥泰坦#1|【图鉴】地府泰坦#1|【图鉴】修罗泰坦#1|【图鉴】焚天泰坦#1|【图鉴】噬月泰坦#1|【图鉴】灭世泰坦#1|【图鉴】末日泰坦#1|【图鉴】瘟疫泰坦#1|【图鉴】精绝泰坦#1|【图鉴】献王泰坦#1]],
		["var"]=1, 
	},
	["转生宝箱"] = {
 		["key_name"]=[[转生宝箱]],
		["item"]=[[1转之书#9|2转之书#9|3转之书#9|4转之书#9]],
		["var"]=2, 
	},
	["特殊宝箱"] = {
 		["key_name"]=[[特殊宝箱]],
		["item"]=[[斗笠精华#18|勋章精华#18|护符精华#18|军鼓精华#18|血石精华#18]],
		["var"]=2, 
	},
	["生肖宝箱"] = {
 		["key_name"]=[[生肖宝箱]],
		["item"]=[[生肖精华#18]],
		["var"]=2, 
	},
	["强化宝箱"] = {
 		["key_name"]=[[强化宝箱]],
		["item"]=[[强化宝石#10]],
		["var"]=2, 
	},
	["极品宝箱"] = {
 		["key_name"]=[[极品宝箱]],
		["item"]=[[洗练石#10]],
		["var"]=2, 
	},
	["经脉宝箱"] = {
 		["key_name"]=[[经脉宝箱]],
		["item"]=[[金针#18|洗髓丹#9]],
		["var"]=2, 
	},
	["传说宝匣"] = {
 		["key_name"]=[[传说宝匣]],
		["item"]=[[憎恨结晶Lv1#1|地狱熔核Lv1#1|毁灭之心Lv1#1|闪电水晶Lv1#1|亡者低语Lv1#1|裂界回响Lv1#1|恶念具现Lv1#1|时缚诅咒Lv1#1|狱炎星火Lv1#1|圣裁余晖Lv1#1|炼狱魔石Lv1#1|暮光契约Lv1#1|盟约星光Lv1#1|双生镜像Lv1#1|缚能咒印Lv1#1]],
		["var"]=2, 
	},
	["初级装扮宝箱"] = {
 		["key_name"]=[[初级装扮宝箱]],
		["item"]="[时装激活卡]街头小子#1|[时装激活卡]幽灵盗贼#1|[时装激活卡]亡灵死神#1|[时装激活卡]地狱守卫#1|[时装激活卡]黄金卫士#1|[时装激活卡]暗影剑圣#1|[时装激活卡]我还是个宝宝#1|[时装激活卡]兽人王#1|[足迹激活卡]金榜题名#1|[足迹激活卡]财运滚滚#1|[足迹激活卡]花开四季#1|[足迹激活卡]步步生金#1|[宠物激活卡]金龙#1|[宠物激活卡]火鸟#1",
		["var"]=1, 
	},
	["高级装扮宝箱"] = {
 		["key_name"]=[[高级装扮宝箱]],
		["item"]="[时装激活卡]忍者#1|[时装激活卡]姜子牙#1|[时装激活卡]亡灵女妖#1|[时装激活卡]鬼武者#1|[时装激活卡]黄金战神#1|[时装激活卡]李逍遥#1|[时装激活卡]锦衣卫#1|[时装激活卡]橘右京#1|[足迹激活卡]六六大顺#1|[足迹激活卡]五彩缤纷#1|[足迹激活卡]疾如风#1|[足迹激活卡]礼花炮#1|[宠物激活卡]麒麟#1|[宠物激活卡]鹿仙#1",
		["var"]=1, 
	},
	["史诗装扮宝箱"] = {
 		["key_name"]=[[史诗装扮宝箱]],
		["item"]="[时装激活卡]浪客剑心#1|[时装激活卡]执法者#1|[时装激活卡]双头金刚#1|[时装激活卡]斗战胜佛#1|[时装激活卡]三太子#1|[时装激活卡]战神吕布#1|[时装激活卡]紫霞仙子#1|[时装激活卡]龙骑士#1|[足迹激活卡]水生财#1|[足迹激活卡]南瓜头#1|[足迹激活卡]小金龙#1|[足迹激活卡]月如意#1|[宠物激活卡]朱雀#1|[宠物激活卡]凤凰#1",
		["var"]=1, 
	},
	["传说装扮宝箱"] = {
 		["key_name"]=[[传说装扮宝箱]],
		["item"]="[时装激活卡]地府判官#1|[时装激活卡]無双飞将#1|[时装激活卡]海王#1|[时装激活卡]灵珠子#1|[时装激活卡]暗夜剑客#1|[时装激活卡]侍魂#1|[时装激活卡]无畏冲锋#1|[时装激活卡]剑无双#1|[足迹激活卡]大鸡大利#1|[足迹激活卡]福气临门#1|[足迹激活卡]星光灿烂#1|[足迹激活卡]纯爱战士#1|[宠物激活卡]狐妖#1|[宠物激活卡]蛇王#1",
		["var"]=1, 
	},  
}
 return config;