---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
	[1] = {
 		["key_name"]=1,
		["recharge"]=1,
		["giveitem"]=[[1亿经验珠#1#370&秘境卷轴#3#370&万能恶魔图鉴#10#370&飞行符#10#370]], 
	},
	[2] = {
 		["key_name"]=2,
		["recharge"]=2,
		["giveitem"]=[[1亿经验珠#2#370&秘境卷轴#3#370&万能恶魔图鉴#20#370&飞行符#20#370]], 
	},
	[3] = {
 		["key_name"]=3,
		["recharge"]=3,
		["giveitem"]=[[1亿经验珠#3#370&秘境卷轴#3#370&万能恶魔图鉴#30#370&飞行符#30#370]], 
	},
	[4] = {
 		["key_name"]=4,
		["recharge"]=4,
		["giveitem"]=[[1亿经验珠#4#370&秘境卷轴#3#370&万能恶魔图鉴#40#370&飞行符#40#370]], 
	},
	[5] = {
 		["key_name"]=5,
		["recharge"]=5,
		["giveitem"]=[[1亿经验珠#5#370&秘境卷轴#3#370&万能恶魔图鉴#50#370&飞行符#50#370]], 
	},
	[6] = {
 		["key_name"]=6,
		["recharge"]=6,
		["giveitem"]=[[1亿经验珠#6#370&秘境卷轴#3#370&万能恶魔图鉴#60#370&飞行符#60#370]], 
	},
	[7] = {
 		["key_name"]=7,
		["recharge"]=7,
		["giveitem"]=[[1亿经验珠#7#370&秘境卷轴#3#370&万能恶魔图鉴#70#370&飞行符#70#370]], 
	},
	[8] = {
 		["key_name"]=8,
		["recharge"]=0,
		["giveitem"]=[[100万经验珠#1#370&飞行符#10#370]], 
	},
}
 return config;