---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["mon_name"]=[[白野猪9]],
		["drop_name"]=[[45级装备随机]],
		["drop_name2"]=[[45级装备随机2]], 
	},
	[2] = {
 		["key_name"]=2,
		["mon_name"]=[[沃玛卫士9]],
		["drop_name"]=[[50级装备随机]],
		["drop_name2"]=[[50级装备随机2]], 
	},
	[3] = {
 		["key_name"]=3,
		["mon_name"]=[[邪恶钳虫9]],
		["drop_name"]=[[55级装备随机]],
		["drop_name2"]=[[55级装备随机2]], 
	},
	[4] = {
 		["key_name"]=4,
		["mon_name"]=[[祖玛卫士9]],
		["drop_name"]=[[60级装备随机]],
		["drop_name2"]=[[60级装备随机2]], 
	},
	[5] = {
 		["key_name"]=5,
		["mon_name"]=[[沃玛教主9]],
		["drop_name"]=[[65级装备随机]],
		["drop_name2"]=[[65级装备随机2]], 
	},
	[6] = {
 		["key_name"]=6,
		["mon_name"]=[[祖玛教主9]],
		["drop_name"]=[[70级装备随机]],
		["drop_name2"]=[[70级装备随机2]], 
	},
	[7] = {
 		["key_name"]=7,
		["mon_name"]=[[双头金刚9]],
		["drop_name"]=[[75级装备随机]],
		["drop_name2"]=[[75级装备随机2]], 
	},
	[8] = {
 		["key_name"]=8,
		["mon_name"]=[[双头血魔9]],
		["drop_name"]=[[80级装备随机]],
		["drop_name2"]=[[80级装备随机2]], 
	},
	[9] = {
 		["key_name"]=9,
		["mon_name"]=[[魔影巨人9]],
		["drop_name"]=[[上古1装备随机]],
		["drop_name2"]=[[上古1装备随机2]], 
	},
	["45级装备随机"] = {
 		["key_name"]=[[45级装备随机]],
		["drop_equip_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔靴子","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂靴子",}, 
	},
	["50级装备随机"] = {
 		["key_name"]=[[50级装备随机]],
		["drop_equip_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔靴子","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂靴子","奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴",}, 
	},
	["55级装备随机"] = {
 		["key_name"]=[[55级装备随机]],
		["drop_equip_arr"]={"奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴","虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴",}, 
	},
	["60级装备随机"] = {
 		["key_name"]=[[60级装备随机]],
		["drop_equip_arr"]={"虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴",}, 
	},
	["65级装备随机"] = {
 		["key_name"]=[[65级装备随机]],
		["drop_equip_arr"]={"虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴","霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴",}, 
	},
	["70级装备随机"] = {
 		["key_name"]=[[70级装备随机]],
		["drop_equip_arr"]={"霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴",}, 
	},
	["75级装备随机"] = {
 		["key_name"]=[[75级装备随机]],
		["drop_equip_arr"]={"霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴","刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","祝融法盔","祝融法链","祝融法镯","祝融法戒","祝融法带","祝融法靴","阴阳道盔","阴阳道链","阴阳道镯","阴阳道戒","阴阳道带","阴阳道靴",}, 
	},
	["80级装备随机"] = {
 		["key_name"]=[[80级装备随机]],
		["drop_equip_arr"]={"刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","祝融法盔","祝融法链","祝融法镯","祝融法戒","祝融法带","祝融法靴","阴阳道盔","阴阳道链","阴阳道镯","阴阳道戒","阴阳道带","阴阳道靴",}, 
	},
	["上古1装备随机"] = {
 		["key_name"]=[[上古1装备随机]],
		["drop_equip_arr"]={"天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","麒麟魔盔","麒麟魔链","麒麟魔镯","麒麟魔戒","麒麟魔带","麒麟魔靴","无极道盔","无极道链","无极道镯","无极道戒","无极道带","无极道靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴",}, 
	},
	["45级装备随机2"] = {
 		["key_name"]=[[45级装备随机2]],
		["drop_equip_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔靴子","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂靴子","奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴","开天","镇天","玄天",}, 
	},
	["50级装备随机2"] = {
 		["key_name"]=[[50级装备随机2]],
		["drop_equip_arr"]={"奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴","虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴","开天","镇天","玄天",}, 
	},
	["55级装备随机2"] = {
 		["key_name"]=[[55级装备随机2]],
		["drop_equip_arr"]={"虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴","霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴","祖玛裁决","祖玛骨玉","祖玛龙纹",}, 
	},
	["60级装备随机2"] = {
 		["key_name"]=[[60级装备随机2]],
		["drop_equip_arr"]={"霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴","刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","祝融法盔","祝融法链","祝融法镯","祝融法戒","祝融法带","祝融法靴","阴阳道盔","阴阳道链","阴阳道镯","阴阳道戒","阴阳道带","阴阳道靴","神圣屠龙","神圣嗜魂","神圣逍遥扇",}, 
	},
	["65级装备随机2"] = {
 		["key_name"]=[[65级装备随机2]],
		["drop_equip_arr"]={"刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","祝融法盔","祝融法链","祝融法镯","祝融法戒","祝融法带","祝融法靴","阴阳道盔","阴阳道链","阴阳道镯","阴阳道戒","阴阳道带","阴阳道靴","流光斧","聚魔法杖","天机棍",}, 
	},
	["70级装备随机2"] = {
 		["key_name"]=[[70级装备随机2]],
		["drop_equip_arr"]={"天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","麒麟魔盔","麒麟魔链","麒麟魔镯","麒麟魔戒","麒麟魔带","麒麟魔靴","无极道盔","无极道链","无极道镯","无极道戒","无极道带","无极道靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴","月光斩","离魂魔杖","封魔剑",}, 
	},
	["75级装备随机2"] = {
 		["key_name"]=[[75级装备随机2]],
		["drop_equip_arr"]={"天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","麒麟魔盔","麒麟魔链","麒麟魔镯","麒麟魔戒","麒麟魔带","麒麟魔靴","无极道盔","无极道链","无极道镯","无极道戒","无极道带","无极道靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴","阎魔","天神法杖","银蛇剑",}, 
	},
	["80级装备随机2"] = {
 		["key_name"]=[[80级装备随机2]],
		["drop_equip_arr"]={"天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","麒麟魔盔","麒麟魔链","麒麟魔镯","麒麟魔戒","麒麟魔带","麒麟魔靴","无极道盔","无极道链","无极道镯","无极道戒","无极道带","无极道靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴","鬼王","七彩魔刃","破魂剑",}, 
	},
	["上古1装备随机2"] = {
 		["key_name"]=[[上古1装备随机2]],
		["drop_equip_arr"]={"天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","麒麟魔盔","麒麟魔链","麒麟魔镯","麒麟魔戒","麒麟魔带","麒麟魔靴","无极道盔","无极道链","无极道镯","无极道戒","无极道带","无极道靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴","狂雷","千年玄冰","太乙羽",}, 
	},  
}
 return config;