---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["鬼王"] = {
 		["key_name"]=[[鬼王]], 
	},
	["啸天战甲(男)"] = {
 		["key_name"]=[[啸天战甲(男)]], 
	},
	["啸天战甲(女)"] = {
 		["key_name"]=[[啸天战甲(女)]], 
	},
	["七彩魔刃"] = {
 		["key_name"]=[[七彩魔刃]], 
	},
	["暗月魔衣(男)"] = {
 		["key_name"]=[[暗月魔衣(男)]], 
	},
	["暗月魔衣(女)"] = {
 		["key_name"]=[[暗月魔衣(女)]], 
	},
	["破魂剑"] = {
 		["key_name"]=[[破魂剑]], 
	},
	["太玄道袍(男)"] = {
 		["key_name"]=[[太玄道袍(男)]], 
	},
	["太玄道袍(女)"] = {
 		["key_name"]=[[太玄道袍(女)]], 
	},
	["狂雷"] = {
 		["key_name"]=[[狂雷]], 
	},
	["追日战甲(男)"] = {
 		["key_name"]=[[追日战甲(男)]], 
	},
	["追日战甲(女)"] = {
 		["key_name"]=[[追日战甲(女)]], 
	},
	["千年玄冰"] = {
 		["key_name"]=[[千年玄冰]], 
	},
	["揽月法衣(男)"] = {
 		["key_name"]=[[揽月法衣(男)]], 
	},
	["揽月法衣(女)"] = {
 		["key_name"]=[[揽月法衣(女)]], 
	},
	["太乙羽"] = {
 		["key_name"]=[[太乙羽]], 
	},
	["摘星道袍(男)"] = {
 		["key_name"]=[[摘星道袍(男)]], 
	},
	["摘星道袍(女)"] = {
 		["key_name"]=[[摘星道袍(女)]], 
	},
	["破魔"] = {
 		["key_name"]=[[破魔]], 
	},
	["金刚战甲(男)"] = {
 		["key_name"]=[[金刚战甲(男)]], 
	},
	["金刚战甲(女)"] = {
 		["key_name"]=[[金刚战甲(女)]], 
	},
	["霜之魂"] = {
 		["key_name"]=[[霜之魂]], 
	},
	["五行法衣(男)"] = {
 		["key_name"]=[[五行法衣(男)]], 
	},
	["五行法衣(女)"] = {
 		["key_name"]=[[五行法衣(女)]], 
	},
	["龙鳞羽"] = {
 		["key_name"]=[[龙鳞羽]], 
	},
	["神谕道袍(男)"] = {
 		["key_name"]=[[神谕道袍(男)]], 
	},
	["神谕道袍(女)"] = {
 		["key_name"]=[[神谕道袍(女)]], 
	},
	["耀光"] = {
 		["key_name"]=[[耀光]], 
	},
	["破坏战甲(男)"] = {
 		["key_name"]=[[破坏战甲(男)]], 
	},
	["破坏战甲(女)"] = {
 		["key_name"]=[[破坏战甲(女)]], 
	},
	["龙之焰"] = {
 		["key_name"]=[[龙之焰]], 
	},
	["流星魔衣(男)"] = {
 		["key_name"]=[[流星魔衣(男)]], 
	},
	["流星魔衣(女)"] = {
 		["key_name"]=[[流星魔衣(女)]], 
	},
	["降魔剑"] = {
 		["key_name"]=[[降魔剑]], 
	},
	["乾坤道袍(男)"] = {
 		["key_name"]=[[乾坤道袍(男)]], 
	},
	["乾坤道袍(女)"] = {
 		["key_name"]=[[乾坤道袍(女)]], 
	},
	["神罚"] = {
 		["key_name"]=[[神罚]], 
	},
	["帝王战甲(男)"] = {
 		["key_name"]=[[帝王战甲(男)]], 
	},
	["帝王战甲(女)"] = {
 		["key_name"]=[[帝王战甲(女)]], 
	},
	["金刚杖"] = {
 		["key_name"]=[[金刚杖]], 
	},
	["七彩魔衣(男)"] = {
 		["key_name"]=[[七彩魔衣(男)]], 
	},
	["七彩魔衣(女)"] = {
 		["key_name"]=[[七彩魔衣(女)]], 
	},
	["金光剑"] = {
 		["key_name"]=[[金光剑]], 
	},
	["虚空道袍(男)"] = {
 		["key_name"]=[[虚空道袍(男)]], 
	},
	["虚空道袍(女)"] = {
 		["key_name"]=[[虚空道袍(女)]], 
	},
	["天火"] = {
 		["key_name"]=[[天火]], 
	},
	["武圣战甲(男)"] = {
 		["key_name"]=[[武圣战甲(男)]], 
	},
	["武圣战甲(女)"] = {
 		["key_name"]=[[武圣战甲(女)]], 
	},
	["火麒麟"] = {
 		["key_name"]=[[火麒麟]], 
	},
	["雷神法衣(男)"] = {
 		["key_name"]=[[雷神法衣(男)]], 
	},
	["雷神法衣(女)"] = {
 		["key_name"]=[[雷神法衣(女)]], 
	},
	["斩妖剑"] = {
 		["key_name"]=[[斩妖剑]], 
	},
	["泰坦道袍(男)"] = {
 		["key_name"]=[[泰坦道袍(男)]], 
	},
	["泰坦道袍(女)"] = {
 		["key_name"]=[[泰坦道袍(女)]], 
	},
	["赤霄"] = {
 		["key_name"]=[[赤霄]], 
	},
	["英雄战甲(男)"] = {
 		["key_name"]=[[英雄战甲(男)]], 
	},
	["英雄战甲(女)"] = {
 		["key_name"]=[[英雄战甲(女)]], 
	},
	["冰与火"] = {
 		["key_name"]=[[冰与火]], 
	},
	["魔灵法衣(男)"] = {
 		["key_name"]=[[魔灵法衣(男)]], 
	},
	["魔灵法衣(女)"] = {
 		["key_name"]=[[魔灵法衣(女)]], 
	},
	["真武剑"] = {
 		["key_name"]=[[真武剑]], 
	},
	["阐释道袍(男)"] = {
 		["key_name"]=[[阐释道袍(男)]], 
	},
	["阐释道袍(女)"] = {
 		["key_name"]=[[阐释道袍(女)]], 
	},
	["绝命"] = {
 		["key_name"]=[[绝命]], 
	},
	["赤龙战甲(男)"] = {
 		["key_name"]=[[赤龙战甲(男)]], 
	},
	["赤龙战甲(女)"] = {
 		["key_name"]=[[赤龙战甲(女)]], 
	},
	["寒光"] = {
 		["key_name"]=[[寒光]], 
	},
	["追魂魔衣(男)"] = {
 		["key_name"]=[[追魂魔衣(男)]], 
	},
	["追魂魔衣(女)"] = {
 		["key_name"]=[[追魂魔衣(女)]], 
	},
	["乾坤法则"] = {
 		["key_name"]=[[乾坤法则]], 
	},
	["昆仑道袍(男)"] = {
 		["key_name"]=[[昆仑道袍(男)]], 
	},
	["昆仑道袍(女)"] = {
 		["key_name"]=[[昆仑道袍(女)]], 
	},
	["龙影"] = {
 		["key_name"]=[[龙影]], 
	},
	["阎罗战甲(男)"] = {
 		["key_name"]=[[阎罗战甲(男)]], 
	},
	["阎罗战甲(女)"] = {
 		["key_name"]=[[阎罗战甲(女)]], 
	},
	["七星"] = {
 		["key_name"]=[[七星]], 
	},
	["毁灭魔衣(男)"] = {
 		["key_name"]=[[毁灭魔衣(男)]], 
	},
	["毁灭魔衣(女)"] = {
 		["key_name"]=[[毁灭魔衣(女)]], 
	},
	["灵魂宝镜"] = {
 		["key_name"]=[[灵魂宝镜]], 
	},
	["避邪道袍(男)"] = {
 		["key_name"]=[[避邪道袍(男)]], 
	},
	["避邪道袍(女)"] = {
 		["key_name"]=[[避邪道袍(女)]], 
	},
	["神陨"] = {
 		["key_name"]=[[神陨]], 
	},
	["圣山战甲(男)"] = {
 		["key_name"]=[[圣山战甲(男)]], 
	},
	["圣山战甲(女)"] = {
 		["key_name"]=[[圣山战甲(女)]], 
	},
	["神怒"] = {
 		["key_name"]=[[神怒]], 
	},
	["冥王魔衣(男)"] = {
 		["key_name"]=[[冥王魔衣(男)]], 
	},
	["冥王魔衣(女)"] = {
 		["key_name"]=[[冥王魔衣(女)]], 
	},
	["道法自然"] = {
 		["key_name"]=[[道法自然]], 
	},
	["如来道袍(男)"] = {
 		["key_name"]=[[如来道袍(男)]], 
	},
	["如来道袍(女)"] = {
 		["key_name"]=[[如来道袍(女)]], 
	},  
}
 return config;