---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[89] = {
 		["key_name"]=89,
		["equip_arr00"]={"打野刀",}, 
	},
	[0] = {
 		["key_name"]=0,
		["equip_arr00"]={"战神盔甲(男)","天魔神甲","上古神甲","雷霆战甲(男)",},
		["equip_arr01"]={"战神盔甲(女)","圣战宝甲","上古宝甲","雷霆战甲(女)",},
		["equip_arr10"]={"恶魔长袍(男)","法神披风","上古披风","烈焰魔衣(男)",},
		["equip_arr11"]={"烈焰魔衣(女)","上古羽衣","霓裳羽衣","恶魔长袍(女)",},
		["equip_arr20"]={"幽灵战衣(男)","天尊道袍","上古道袍","光芒道袍(男)","极光道袍(男)",},
		["equip_arr21"]={"幽灵战衣(女)","天尊长袍","上古长袍","光芒道袍(女)","极光道袍(女)",}, 
	},
	[1] = {
 		["key_name"]=1,
		["equip_arr00"]={"裁决之杖","开天","怒斩","屠龙",},
		["equip_arr10"]={"龙牙","嗜魂法杖","紫金嗜魂法杖","镇天",},
		["equip_arr20"]={"逍遥扇","赤血魔剑","赤金逍遥扇","玄天",}, 
	},
	[3] = {
 		["key_name"]=3,
		["equip_arr00"]={"圣战项链","雷霆项链","战神项链","奔雷项链",},
		["equip_arr10"]={"法神项链","烈焰项链","圣魔项链","怒焰项链",},
		["equip_arr20"]={"天尊项链","光芒项链","真魂项链","极光项链",}, 
	},
	[4] = {
 		["key_name"]=4,
		["equip_arr00"]={"圣战头盔","天龙盔",},
		["equip_arr10"]={"魔龙盔","法神头盔",},
		["equip_arr20"]={"天尊头盔","圣龙盔",}, 
	},
	[5] = {
 		["key_name"]=5,
		["equip_arr00"]={"圣战手镯","雷霆护腕","战神手镯","奔雷护腕",},
		["equip_arr10"]={"法神手镯","烈焰护腕","圣魔手镯","怒焰护腕",},
		["equip_arr20"]={"天尊手镯","光芒护腕","真魂手镯","极光护腕",}, 
	},
	[6] = {
 		["key_name"]=6,
		["equip_arr00"]={"圣战手镯","雷霆护腕","战神手镯","奔雷护腕",},
		["equip_arr10"]={"法神手镯","烈焰护腕","圣魔手镯","怒焰护腕",},
		["equip_arr20"]={"天尊手镯","光芒护腕","真魂手镯","极光护腕",}, 
	},
	[7] = {
 		["key_name"]=7,
		["equip_arr00"]={"圣战戒指","雷霆战戒","战神戒指","奔雷战戒",},
		["equip_arr10"]={"法神戒指","烈焰魔戒","圣魔戒指","怒焰魔戒",},
		["equip_arr20"]={"天尊戒指","光芒道戒","真魂戒指","极光道戒",}, 
	},
	[8] = {
 		["key_name"]=8,
		["equip_arr00"]={"圣战戒指","雷霆战戒","战神戒指","奔雷战戒",},
		["equip_arr10"]={"法神戒指","烈焰魔戒","圣魔戒指","怒焰魔戒",},
		["equip_arr20"]={"天尊戒指","光芒道戒","真魂戒指","极光道戒",}, 
	},
	[10] = {
 		["key_name"]=10,
		["equip_arr00"]={"雷霆腰带","战神腰带","奔雷腰带",},
		["equip_arr10"]={"烈焰腰带","圣魔腰带",},
		["equip_arr20"]={"真魂腰带","极光腰带",}, 
	},
	[11] = {
 		["key_name"]=11,
		["equip_arr00"]={"雷霆战靴","战神靴子",},
		["equip_arr10"]={"圣魔靴子","烈焰魔靴",},
		["equip_arr20"]={"真魂靴子","","光芒道靴",}, 
	},  
}
 return config;