---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]=[[盾牌打造]],
		["equip_arr"]={"玄铁盾","蛟鳞盾","血纹盾","磐岩盾","龙魂盾","圣光盾","天罡盾","幽冥盾","罗刹盾","九霄雷音盾",},
		["position"]=16, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]=[[斗笠打造]],
		["equip_arr"]={"斗笠·Lv2","斗笠·Lv3","斗笠·Lv4","斗笠·Lv5","斗笠·Lv6","斗笠·Lv7","斗笠·Lv8","斗笠·Lv9","终极斗笠",},
		["position"]=13, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]=[[勋章打造]],
		["equip_arr"]={"勋章·Lv2","勋章·Lv3","勋章·Lv4","勋章·Lv5","勋章·Lv6","勋章·Lv7","勋章·Lv8","勋章·Lv9","终极勋章",},
		["position"]=2, 
	},
	[4] = {
 		["key_name"]=4,
		["type"]=[[护符打造]],
		["equip_arr"]={"护符·Lv2","护符·Lv3","护符·Lv4","护符·Lv5","护符·Lv6","护符·Lv7","护符·Lv8","护符·Lv9","终极护符",},
		["position"]=9, 
	},
	[5] = {
 		["key_name"]=5,
		["type"]=[[军鼓打造]],
		["equip_arr"]={"军鼓·Lv2","军鼓·Lv3","军鼓·Lv4","军鼓·Lv5","军鼓·Lv6","军鼓·Lv7","军鼓·Lv8","军鼓·Lv9","终极军鼓",},
		["position"]=14, 
	},
	[6] = {
 		["key_name"]=6,
		["type"]=[[血石打造]],
		["equip_arr"]={"血石·Lv2","血石·Lv3","血石·Lv4","血石·Lv5","血石·Lv6","血石·Lv7","血石·Lv8","血石·Lv9","终极血石",},
		["position"]=12, 
	},
	["玄铁盾"] = {
 		["key_name"]=[[玄铁盾]],
		["need_config"]={{"龙鳞",10,0}}, 
	},
	["蛟鳞盾"] = {
 		["key_name"]=[[蛟鳞盾]],
		["need_config"]={{"玄铁盾",2,0},{"元宝",100,2}}, 
	},
	["血纹盾"] = {
 		["key_name"]=[[血纹盾]],
		["need_config"]={{"蛟鳞盾",2,0},{"元宝",200,2}}, 
	},
	["磐岩盾"] = {
 		["key_name"]=[[磐岩盾]],
		["need_config"]={{"血纹盾",2,0},{"元宝",300,2}}, 
	},
	["龙魂盾"] = {
 		["key_name"]=[[龙魂盾]],
		["need_config"]={{"磐岩盾",2,0},{"元宝",500,2}}, 
	},
	["圣光盾"] = {
 		["key_name"]=[[圣光盾]],
		["need_config"]={{"龙魂盾",2,0},{"元宝",800,2}}, 
	},
	["天罡盾"] = {
 		["key_name"]=[[天罡盾]],
		["need_config"]={{"圣光盾",2,0},{"元宝",1200,2}}, 
	},
	["幽冥盾"] = {
 		["key_name"]=[[幽冥盾]],
		["need_config"]={{"天罡盾",2,0},{"元宝",2500,2}}, 
	},
	["罗刹盾"] = {
 		["key_name"]=[[罗刹盾]],
		["need_config"]={{"幽冥盾",2,0},{"元宝",5000,2}}, 
	},
	["九霄雷音盾"] = {
 		["key_name"]=[[九霄雷音盾]],
		["need_config"]={{"罗刹盾",2,0},{"元宝",10000,2}}, 
	},
	["斗笠·Lv2"] = {
 		["key_name"]=[[斗笠·Lv2]],
		["need_config"]={{"斗笠·Lv1",1,0},{"五行精华",5,0},{"元宝",200,2}}, 
	},
	["斗笠·Lv3"] = {
 		["key_name"]=[[斗笠·Lv3]],
		["need_config"]={{"斗笠·Lv2",1,0},{"五行精华",10,0},{"元宝",300,2}}, 
	},
	["斗笠·Lv4"] = {
 		["key_name"]=[[斗笠·Lv4]],
		["need_config"]={{"斗笠·Lv3",1,0},{"五行精华",20,0},{"元宝",500,2}}, 
	},
	["斗笠·Lv5"] = {
 		["key_name"]=[[斗笠·Lv5]],
		["need_config"]={{"斗笠·Lv4",1,0},{"五行精华",50,0},{"元宝",800,2}}, 
	},
	["斗笠·Lv6"] = {
 		["key_name"]=[[斗笠·Lv6]],
		["need_config"]={{"斗笠·Lv5",1,0},{"五行精华",100,0},{"元宝",1200,2}}, 
	},
	["斗笠·Lv7"] = {
 		["key_name"]=[[斗笠·Lv7]],
		["need_config"]={{"斗笠·Lv6",1,0},{"五行精华",200,0},{"元宝",2500,2}}, 
	},
	["斗笠·Lv8"] = {
 		["key_name"]=[[斗笠·Lv8]],
		["need_config"]={{"斗笠·Lv7",1,0},{"五行精华",300,0},{"元宝",5000,2}}, 
	},
	["斗笠·Lv9"] = {
 		["key_name"]=[[斗笠·Lv9]],
		["need_config"]={{"斗笠·Lv8",1,0},{"五行精华",500,0},{"元宝",10000,2}}, 
	},
	["终极斗笠"] = {
 		["key_name"]=[[终极斗笠]],
		["need_config"]={{"斗笠·Lv9",1,0},{"五行精华",1000,0},{"元宝",20000,2}}, 
	},
	["勋章·Lv2"] = {
 		["key_name"]=[[勋章·Lv2]],
		["need_config"]={{"勋章·Lv1",1,0},{"五行精华",5,0},{"元宝",200,2}}, 
	},
	["勋章·Lv3"] = {
 		["key_name"]=[[勋章·Lv3]],
		["need_config"]={{"勋章·Lv2",1,0},{"五行精华",10,0},{"元宝",300,2}}, 
	},
	["勋章·Lv4"] = {
 		["key_name"]=[[勋章·Lv4]],
		["need_config"]={{"勋章·Lv3",1,0},{"五行精华",20,0},{"元宝",500,2}}, 
	},
	["勋章·Lv5"] = {
 		["key_name"]=[[勋章·Lv5]],
		["need_config"]={{"勋章·Lv4",1,0},{"五行精华",50,0},{"元宝",800,2}}, 
	},
	["勋章·Lv6"] = {
 		["key_name"]=[[勋章·Lv6]],
		["need_config"]={{"勋章·Lv5",1,0},{"五行精华",100,0},{"元宝",1200,2}}, 
	},
	["勋章·Lv7"] = {
 		["key_name"]=[[勋章·Lv7]],
		["need_config"]={{"勋章·Lv6",1,0},{"五行精华",200,0},{"元宝",2500,2}}, 
	},
	["勋章·Lv8"] = {
 		["key_name"]=[[勋章·Lv8]],
		["need_config"]={{"勋章·Lv7",1,0},{"五行精华",300,0},{"元宝",5000,2}}, 
	},
	["勋章·Lv9"] = {
 		["key_name"]=[[勋章·Lv9]],
		["need_config"]={{"勋章·Lv8",1,0},{"五行精华",500,0},{"元宝",10000,2}}, 
	},
	["终极勋章"] = {
 		["key_name"]=[[终极勋章]],
		["need_config"]={{"勋章·Lv9",1,0},{"五行精华",1000,0},{"元宝",20000,2}}, 
	},
	["护符·Lv2"] = {
 		["key_name"]=[[护符·Lv2]],
		["need_config"]={{"护符·Lv1",1,0},{"五行精华",5,0},{"元宝",200,2}}, 
	},
	["护符·Lv3"] = {
 		["key_name"]=[[护符·Lv3]],
		["need_config"]={{"护符·Lv2",1,0},{"五行精华",10,0},{"元宝",300,2}}, 
	},
	["护符·Lv4"] = {
 		["key_name"]=[[护符·Lv4]],
		["need_config"]={{"护符·Lv3",1,0},{"五行精华",20,0},{"元宝",500,2}}, 
	},
	["护符·Lv5"] = {
 		["key_name"]=[[护符·Lv5]],
		["need_config"]={{"护符·Lv4",1,0},{"五行精华",50,0},{"元宝",800,2}}, 
	},
	["护符·Lv6"] = {
 		["key_name"]=[[护符·Lv6]],
		["need_config"]={{"护符·Lv5",1,0},{"五行精华",100,0},{"元宝",1200,2}}, 
	},
	["护符·Lv7"] = {
 		["key_name"]=[[护符·Lv7]],
		["need_config"]={{"护符·Lv6",1,0},{"五行精华",200,0},{"元宝",2500,2}}, 
	},
	["护符·Lv8"] = {
 		["key_name"]=[[护符·Lv8]],
		["need_config"]={{"护符·Lv7",1,0},{"五行精华",300,0},{"元宝",5000,2}}, 
	},
	["护符·Lv9"] = {
 		["key_name"]=[[护符·Lv9]],
		["need_config"]={{"护符·Lv8",1,0},{"五行精华",500,0},{"元宝",10000,2}}, 
	},
	["终极护符"] = {
 		["key_name"]=[[终极护符]],
		["need_config"]={{"护符·Lv9",1,0},{"五行精华",1000,0},{"元宝",20000,2}}, 
	},
	["军鼓·Lv2"] = {
 		["key_name"]=[[军鼓·Lv2]],
		["need_config"]={{"军鼓·Lv1",1,0},{"五行精华",5,0},{"元宝",200,2}}, 
	},
	["军鼓·Lv3"] = {
 		["key_name"]=[[军鼓·Lv3]],
		["need_config"]={{"军鼓·Lv2",1,0},{"五行精华",10,0},{"元宝",300,2}}, 
	},
	["军鼓·Lv4"] = {
 		["key_name"]=[[军鼓·Lv4]],
		["need_config"]={{"军鼓·Lv3",1,0},{"五行精华",20,0},{"元宝",500,2}}, 
	},
	["军鼓·Lv5"] = {
 		["key_name"]=[[军鼓·Lv5]],
		["need_config"]={{"军鼓·Lv4",1,0},{"五行精华",50,0},{"元宝",800,2}}, 
	},
	["军鼓·Lv6"] = {
 		["key_name"]=[[军鼓·Lv6]],
		["need_config"]={{"军鼓·Lv5",1,0},{"五行精华",100,0},{"元宝",1200,2}}, 
	},
	["军鼓·Lv7"] = {
 		["key_name"]=[[军鼓·Lv7]],
		["need_config"]={{"军鼓·Lv6",1,0},{"五行精华",200,0},{"元宝",2500,2}}, 
	},
	["军鼓·Lv8"] = {
 		["key_name"]=[[军鼓·Lv8]],
		["need_config"]={{"军鼓·Lv7",1,0},{"五行精华",300,0},{"元宝",5000,2}}, 
	},
	["军鼓·Lv9"] = {
 		["key_name"]=[[军鼓·Lv9]],
		["need_config"]={{"军鼓·Lv8",1,0},{"五行精华",500,0},{"元宝",10000,2}}, 
	},
	["终极军鼓"] = {
 		["key_name"]=[[终极军鼓]],
		["need_config"]={{"军鼓·Lv9",1,0},{"五行精华",1000,0},{"元宝",20000,2}}, 
	},
	["血石·Lv2"] = {
 		["key_name"]=[[血石·Lv2]],
		["need_config"]={{"血石·Lv1",1,0},{"五行精华",5,0},{"元宝",200,2}}, 
	},
	["血石·Lv3"] = {
 		["key_name"]=[[血石·Lv3]],
		["need_config"]={{"血石·Lv2",1,0},{"五行精华",10,0},{"元宝",300,2}}, 
	},
	["血石·Lv4"] = {
 		["key_name"]=[[血石·Lv4]],
		["need_config"]={{"血石·Lv3",1,0},{"五行精华",20,0},{"元宝",500,2}}, 
	},
	["血石·Lv5"] = {
 		["key_name"]=[[血石·Lv5]],
		["need_config"]={{"血石·Lv4",1,0},{"五行精华",50,0},{"元宝",800,2}}, 
	},
	["血石·Lv6"] = {
 		["key_name"]=[[血石·Lv6]],
		["need_config"]={{"血石·Lv5",1,0},{"五行精华",100,0},{"元宝",1200,2}}, 
	},
	["血石·Lv7"] = {
 		["key_name"]=[[血石·Lv7]],
		["need_config"]={{"血石·Lv6",1,0},{"五行精华",200,0},{"元宝",2500,2}}, 
	},
	["血石·Lv8"] = {
 		["key_name"]=[[血石·Lv8]],
		["need_config"]={{"血石·Lv7",1,0},{"五行精华",300,0},{"元宝",5000,2}}, 
	},
	["血石·Lv9"] = {
 		["key_name"]=[[血石·Lv9]],
		["need_config"]={{"血石·Lv8",1,0},{"五行精华",500,0},{"元宝",10000,2}}, 
	},
	["终极血石"] = {
 		["key_name"]=[[终极血石]],
		["need_config"]={{"血石·Lv9",1,0},{"五行精华",1000,0},{"元宝",20000,2}}, 
	},  
}
 return config;