---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["泰坦神王·恐惧之源"] = {
 		["key_name"]=[[泰坦神王·恐惧之源]],
		["item"]=[[风暴凭证]], 
	},
	["泰坦神王·荒原瘟神"] = {
 		["key_name"]=[[泰坦神王·荒原瘟神]],
		["item"]=[[风暴凭证]], 
	},
	["泰坦神王·诡影蛇王"] = {
 		["key_name"]=[[泰坦神王·诡影蛇王]],
		["item"]=[[风暴凭证]], 
	},
	["泰坦神王·狂血战王"] = {
 		["key_name"]=[[泰坦神王·狂血战王]],
		["item"]=[[风暴凭证]], 
	},
	["泰坦神王·碎城巨孽"] = {
 		["key_name"]=[[泰坦神王·碎城巨孽]],
		["item"]=[[风暴凭证]], 
	},
	["泰坦神王·血蹄兽王"] = {
 		["key_name"]=[[泰坦神王·血蹄兽王]],
		["item"]=[[雪原凭证]], 
	},
	["泰坦神王·噬魂花王"] = {
 		["key_name"]=[[泰坦神王·噬魂花王]],
		["item"]=[[雪原凭证]], 
	},
	["泰坦神王·裂隙魔眼"] = {
 		["key_name"]=[[泰坦神王·裂隙魔眼]],
		["item"]=[[雪原凭证]], 
	},
	["泰坦神王·炎脉暴君"] = {
 		["key_name"]=[[泰坦神王·炎脉暴君]],
		["item"]=[[雪原凭证]], 
	},
	["泰坦神王·血池侍神"] = {
 		["key_name"]=[[泰坦神王·血池侍神]],
		["item"]=[[蛮荒凭证]], 
	},
	["泰坦神王·火刑魔神"] = {
 		["key_name"]=[[泰坦神王·火刑魔神]],
		["item"]=[[蛮荒凭证]], 
	},
	["泰坦神王·炎狱暴君"] = {
 		["key_name"]=[[泰坦神王·炎狱暴君]],
		["item"]=[[蛮荒凭证]], 
	},
	["泰坦神王·蚀月妖后"] = {
 		["key_name"]=[[泰坦神王·蚀月妖后]],
		["item"]=[[蛮荒凭证]], 
	},
	["泰坦神王·碎颅暴君"] = {
 		["key_name"]=[[泰坦神王·碎颅暴君]],
		["item"]=[[蛮荒凭证]], 
	},
	["泰坦神王·蚀骨魔母"] = {
 		["key_name"]=[[泰坦神王·蚀骨魔母]],
		["item"]=[[蛮荒凭证]], 
	},  
}
 return config;