---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战靴","修罗魔靴","仙风道靴","啸天战靴","暗月魔靴","太玄道靴",}, 
	},
	[2] = {
 		["key_name"]=2,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战带","修罗魔带","仙风道带","啸天战带","暗月魔带","太玄道带",}, 
	},
	[3] = {
 		["key_name"]=3,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战盔","修罗魔盔","仙风道盔","啸天战盔","暗月魔盔","太玄道盔",}, 
	},
	[4] = {
 		["key_name"]=4,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战戒","修罗魔戒","仙风道戒","啸天战戒","暗月魔戒","太玄道戒",}, 
	},
	[5] = {
 		["key_name"]=5,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战镯","修罗魔镯","仙风道镯","啸天战镯","暗月魔镯","太玄道镯",}, 
	},
	[6] = {
 		["key_name"]=6,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战链","修罗魔链","仙风道链","啸天战链","暗月魔链","太玄道链",}, 
	},
	[7] = {
 		["key_name"]=7,
		["drop_type1"]=[[1000万经验珠]],
		["drop_type2"]={"飓风破","流星火雨","召唤月灵",},
		["drop_type3"]={"龙吟战靴","修罗魔靴","仙风道靴","啸天战靴","暗月魔靴","太玄道靴","龙吟战带","修罗魔带","仙风道带","啸天战带","暗月魔带","太玄道带","龙吟战盔","修罗魔盔","仙风道盔","啸天战盔","暗月魔盔","太玄道盔","龙吟战戒","修罗魔戒","仙风道戒","啸天战戒","暗月魔戒","太玄道戒","龙吟战镯","修罗魔镯","仙风道镯","啸天战镯","暗月魔镯","太玄道镯","龙吟战链","修罗魔链","仙风道链","啸天战链","暗月魔链","太玄道链",}, 
	},  
}
 return config;