---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"龙吟战靴","修罗魔靴","仙风道靴","刑天战靴","祝融法靴","阴阳道靴","天赐战靴","麒麟魔靴","无极道靴",}, 
	},
	[2] = {
 		["key_name"]=2,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"龙吟战带","修罗魔带","仙风道带","刑天战带","祝融法带","阴阳道带","天赐战带","麒麟魔带","无极道带",}, 
	},
	[3] = {
 		["key_name"]=3,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"龙吟战盔","修罗魔盔","仙风道盔","刑天战盔","祝融法盔","阴阳道盔","天赐战盔","麒麟魔盔","无极道盔",}, 
	},
	[4] = {
 		["key_name"]=4,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"龙吟战戒","修罗魔戒","仙风道戒","刑天战戒","祝融法戒","阴阳道戒","天赐战戒","麒麟魔戒","无极道戒",}, 
	},
	[5] = {
 		["key_name"]=5,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"龙吟战镯","修罗魔镯","仙风道镯","刑天战镯","祝融法镯","阴阳道镯","天赐战镯","麒麟魔镯","无极道镯",}, 
	},
	[6] = {
 		["key_name"]=6,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"龙吟战链","修罗魔链","仙风道链","刑天战链","祝融法链","阴阳道链","天赐战链","麒麟魔链","无极道链",}, 
	},
	[7] = {
 		["key_name"]=7,
		["drop_type1"]=[[1亿经验珠]],
		["drop_type2"]={"擒龙手","开天斩","逐日剑法","嗜血术","飓风破","无极真气","气功波","分身术","灭天火","流星火雨","群体雷电术",},
		["drop_type3"]={"刑天战甲(男)","刑天战甲(女)","祝融魔衣(男)","祝融魔衣(女)","阴阳道袍(男)","阴阳道袍(女)","天赐战甲(男)","天赐战甲(女)","麒麟魔衣(男)","麒麟魔衣(女)","无极道袍(男)","无极道袍(女)","龙吟战甲(男)","龙吟战甲(女)","修罗魔衣(男)","修罗魔衣(女)","仙风道袍(男)","仙风道袍(女)","","流光斧","聚魔法杖","天机棍","月光斩","离魂魔杖","封魔剑","阎魔","天神法杖","银蛇剑",}, 
	},  
}
 return config;