---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["posx"]=22,
		["posy"]=38, 
	},
	[2] = {
 		["key_name"]=2,
		["posx"]=22,
		["posy"]=70, 
	},
	[3] = {
 		["key_name"]=3,
		["posx"]=22,
		["posy"]=102, 
	},
	[4] = {
 		["key_name"]=4,
		["posx"]=22,
		["posy"]=134, 
	},
	[5] = {
 		["key_name"]=5,
		["posx"]=22,
		["posy"]=166, 
	},
	[6] = {
 		["key_name"]=6,
		["posx"]=54,
		["posy"]=150, 
	},
	[7] = {
 		["key_name"]=7,
		["posx"]=54,
		["posy"]=118, 
	},
	[8] = {
 		["key_name"]=8,
		["posx"]=54,
		["posy"]=86, 
	},
	[9] = {
 		["key_name"]=9,
		["posx"]=54,
		["posy"]=54,
		["boss"]=[[上古神兽·青龙]], 
	},
	[10] = {
 		["key_name"]=10,
		["posx"]=86,
		["posy"]=38, 
	},
	[11] = {
 		["key_name"]=11,
		["posx"]=86,
		["posy"]=70, 
	},
	[12] = {
 		["key_name"]=12,
		["posx"]=86,
		["posy"]=102, 
	},
	[13] = {
 		["key_name"]=13,
		["posx"]=86,
		["posy"]=134, 
	},
	[14] = {
 		["key_name"]=14,
		["posx"]=86,
		["posy"]=166, 
	},
	[15] = {
 		["key_name"]=15,
		["posx"]=118,
		["posy"]=182, 
	},
	[16] = {
 		["key_name"]=16,
		["posx"]=118,
		["posy"]=150, 
	},
	[17] = {
 		["key_name"]=17,
		["posx"]=118,
		["posy"]=118, 
	},
	[18] = {
 		["key_name"]=18,
		["posx"]=118,
		["posy"]=86, 
	},
	[19] = {
 		["key_name"]=19,
		["posx"]=118,
		["posy"]=54, 
	},
	[20] = {
 		["key_name"]=20,
		["posx"]=118,
		["posy"]=22,
		["boss"]=[[上古神兽·白虎]], 
	},
	[21] = {
 		["key_name"]=21,
		["posx"]=150,
		["posy"]=38, 
	},
	[22] = {
 		["key_name"]=22,
		["posx"]=150,
		["posy"]=70, 
	},
	[23] = {
 		["key_name"]=23,
		["posx"]=150,
		["posy"]=102, 
	},
	[24] = {
 		["key_name"]=24,
		["posx"]=150,
		["posy"]=134, 
	},
	[25] = {
 		["key_name"]=25,
		["posx"]=150,
		["posy"]=166, 
	},
	[26] = {
 		["key_name"]=26,
		["posx"]=182,
		["posy"]=150, 
	},
	[27] = {
 		["key_name"]=27,
		["posx"]=182,
		["posy"]=118, 
	},
	[28] = {
 		["key_name"]=28,
		["posx"]=182,
		["posy"]=86, 
	},
	[29] = {
 		["key_name"]=29,
		["posx"]=182,
		["posy"]=54,
		["boss"]=[[上古神兽·朱雀]], 
	},
	[30] = {
 		["key_name"]=30,
		["posx"]=214,
		["posy"]=38, 
	},
	[31] = {
 		["key_name"]=31,
		["posx"]=214,
		["posy"]=70, 
	},
	[32] = {
 		["key_name"]=32,
		["posx"]=214,
		["posy"]=102, 
	},
	[33] = {
 		["key_name"]=33,
		["posx"]=214,
		["posy"]=134,
		["boss"]=[[上古神兽·玄武]], 
	},
	[34] = {
 		["key_name"]=34,
		["posx"]=214,
		["posy"]=166, 
	},
	["永久BUFF奖池"] = {
 		["key_name"]=[[永久BUFF奖池]],
		["item_map"]={["100灵符"]=1,["1000灵符"]=1,}, 
	},
	["特殊四格奖池"] = {
 		["key_name"]=[[特殊四格奖池]],
		["item_map"]={["玄铁盾"]=1,["洗练石"]=10,["强化宝石"]=10,}, 
	},
	["通用道具奖池"] = {
 		["key_name"]=[[通用道具奖池]],
		["item_map"]={["血丹"]=3,["书页"]=10,["金针"]=10,["洗髓丹"]=3,["天命石"]=1,}, 
	},
	["随机货币奖池"] = {
 		["key_name"]=[[随机货币奖池]],
		["item_map"]={["1万元宝"]=1,["10万元宝"]=1,["100万元宝"]=1,}, 
	},  
}
 return config;