---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["name"]=[[黄金屠龙]], 
	},
	[2] = {
 		["key_name"]=2,
		["name"]=[[紫金嗜魂法杖]], 
	},
	[3] = {
 		["key_name"]=3,
		["name"]=[[赤金逍遥扇]], 
	},
	[4] = {
 		["key_name"]=4,
		["name"]=[[开天]], 
	},
	[5] = {
 		["key_name"]=5,
		["name"]=[[镇天]], 
	},
	[6] = {
 		["key_name"]=6,
		["name"]=[[玄天]], 
	},
	[7] = {
 		["key_name"]=7,
		["name"]=[[祖玛裁决]], 
	},
	[8] = {
 		["key_name"]=8,
		["name"]=[[神圣屠龙]], 
	},
	[9] = {
 		["key_name"]=9,
		["name"]=[[流光斧]], 
	},
	[10] = {
 		["key_name"]=10,
		["name"]=[[月光斩]], 
	},
	[11] = {
 		["key_name"]=11,
		["name"]=[[阎魔]], 
	},
	[12] = {
 		["key_name"]=12,
		["name"]=[[祖玛骨玉]], 
	},
	[13] = {
 		["key_name"]=13,
		["name"]=[[神圣嗜魂]], 
	},
	[14] = {
 		["key_name"]=14,
		["name"]=[[聚魔法杖]], 
	},
	[15] = {
 		["key_name"]=15,
		["name"]=[[离魂魔杖]], 
	},
	[16] = {
 		["key_name"]=16,
		["name"]=[[天神法杖]], 
	},
	[17] = {
 		["key_name"]=17,
		["name"]=[[祖玛龙纹]], 
	},
	[18] = {
 		["key_name"]=18,
		["name"]=[[神圣逍遥扇]], 
	},
	[19] = {
 		["key_name"]=19,
		["name"]=[[天机棍]], 
	},
	[20] = {
 		["key_name"]=20,
		["name"]=[[封魔剑]], 
	},
	[21] = {
 		["key_name"]=21,
		["name"]=[[银蛇剑]], 
	},
	[22] = {
 		["key_name"]=22,
		["name"]=[[雷霆战甲(男)]], 
	},
	[23] = {
 		["key_name"]=23,
		["name"]=[[雷霆战甲(女)]], 
	},
	[24] = {
 		["key_name"]=24,
		["name"]=[[烈焰魔衣(男)]], 
	},
	[25] = {
 		["key_name"]=25,
		["name"]=[[烈焰魔衣(女)]], 
	},
	[26] = {
 		["key_name"]=26,
		["name"]=[[光芒道袍(男)]], 
	},
	[27] = {
 		["key_name"]=27,
		["name"]=[[光芒道袍(女)]], 
	},
	[28] = {
 		["key_name"]=28,
		["name"]=[[虎啸战甲(男)]], 
	},
	[29] = {
 		["key_name"]=29,
		["name"]=[[虎啸战甲(女)]], 
	},
	[30] = {
 		["key_name"]=30,
		["name"]=[[聚魔法衣(男)]], 
	},
	[31] = {
 		["key_name"]=31,
		["name"]=[[聚魔法衣(女)]], 
	},
	[32] = {
 		["key_name"]=32,
		["name"]=[[暗咒道袍(男)]], 
	},
	[33] = {
 		["key_name"]=33,
		["name"]=[[暗咒道袍(女)]], 
	},
	[34] = {
 		["key_name"]=34,
		["name"]=[[霸王战甲(男)]], 
	},
	[35] = {
 		["key_name"]=35,
		["name"]=[[霸王战甲(女)]], 
	},
	[36] = {
 		["key_name"]=36,
		["name"]=[[离魂魔衣(男)]], 
	},
	[37] = {
 		["key_name"]=37,
		["name"]=[[离魂魔衣(女)]], 
	},
	[38] = {
 		["key_name"]=38,
		["name"]=[[天机道袍(男)]], 
	},
	[39] = {
 		["key_name"]=39,
		["name"]=[[天机道袍(女)]], 
	},
	[40] = {
 		["key_name"]=40,
		["name"]=[[刑天战甲(男)]], 
	},
	[41] = {
 		["key_name"]=41,
		["name"]=[[刑天战甲(女)]], 
	},
	[42] = {
 		["key_name"]=42,
		["name"]=[[祝融魔衣(男)]], 
	},
	[43] = {
 		["key_name"]=43,
		["name"]=[[祝融魔衣(女)]], 
	},
	[44] = {
 		["key_name"]=44,
		["name"]=[[阴阳道袍(男)]], 
	},
	[45] = {
 		["key_name"]=45,
		["name"]=[[阴阳道袍(女)]], 
	},
	[46] = {
 		["key_name"]=46,
		["name"]=[[天赐战甲(男)]], 
	},
	[47] = {
 		["key_name"]=47,
		["name"]=[[天赐战甲(女)]], 
	},
	[48] = {
 		["key_name"]=48,
		["name"]=[[麒麟魔衣(男)]], 
	},
	[49] = {
 		["key_name"]=49,
		["name"]=[[麒麟魔衣(女)]], 
	},
	[50] = {
 		["key_name"]=50,
		["name"]=[[无极道袍(男)]], 
	},
	[51] = {
 		["key_name"]=51,
		["name"]=[[无极道袍(女)]], 
	},
	[52] = {
 		["key_name"]=52,
		["name"]=[[龙吟战甲(男)]], 
	},
	[53] = {
 		["key_name"]=53,
		["name"]=[[龙吟战甲(女)]], 
	},
	[54] = {
 		["key_name"]=54,
		["name"]=[[修罗魔衣(男)]], 
	},
	[55] = {
 		["key_name"]=55,
		["name"]=[[修罗魔衣(女)]], 
	},
	[56] = {
 		["key_name"]=56,
		["name"]=[[仙风道袍(男)]], 
	},
	[57] = {
 		["key_name"]=57,
		["name"]=[[仙风道袍(女)]], 
	},
	[58] = {
 		["key_name"]=58,
		["name"]=[[战神项链]], 
	},
	[59] = {
 		["key_name"]=59,
		["name"]=[[战神手镯]], 
	},
	[60] = {
 		["key_name"]=60,
		["name"]=[[战神戒指]], 
	},
	[61] = {
 		["key_name"]=61,
		["name"]=[[战神腰带]], 
	},
	[62] = {
 		["key_name"]=62,
		["name"]=[[战神靴子]], 
	},
	[63] = {
 		["key_name"]=63,
		["name"]=[[圣魔项链]], 
	},
	[64] = {
 		["key_name"]=64,
		["name"]=[[圣魔手镯]], 
	},
	[65] = {
 		["key_name"]=65,
		["name"]=[[圣魔戒指]], 
	},
	[66] = {
 		["key_name"]=66,
		["name"]=[[圣魔腰带]], 
	},
	[67] = {
 		["key_name"]=67,
		["name"]=[[圣魔靴子]], 
	},
	[68] = {
 		["key_name"]=68,
		["name"]=[[真魂项链]], 
	},
	[69] = {
 		["key_name"]=69,
		["name"]=[[真魂手镯]], 
	},
	[70] = {
 		["key_name"]=70,
		["name"]=[[真魂戒指]], 
	},
	[71] = {
 		["key_name"]=71,
		["name"]=[[真魂腰带]], 
	},
	[72] = {
 		["key_name"]=72,
		["name"]=[[真魂靴子]], 
	},
	[73] = {
 		["key_name"]=73,
		["name"]=[[奔雷项链]], 
	},
	[74] = {
 		["key_name"]=74,
		["name"]=[[奔雷护腕]], 
	},
	[75] = {
 		["key_name"]=75,
		["name"]=[[奔雷战戒]], 
	},
	[76] = {
 		["key_name"]=76,
		["name"]=[[奔雷腰带]], 
	},
	[77] = {
 		["key_name"]=77,
		["name"]=[[奔雷战靴]], 
	},
	[78] = {
 		["key_name"]=78,
		["name"]=[[怒焰项链]], 
	},
	[79] = {
 		["key_name"]=79,
		["name"]=[[怒焰护腕]], 
	},
	[80] = {
 		["key_name"]=80,
		["name"]=[[怒焰魔戒]], 
	},
	[81] = {
 		["key_name"]=81,
		["name"]=[[怒焰腰带]], 
	},
	[82] = {
 		["key_name"]=82,
		["name"]=[[怒焰魔靴]], 
	},
	[83] = {
 		["key_name"]=83,
		["name"]=[[极光项链]], 
	},
	[84] = {
 		["key_name"]=84,
		["name"]=[[极光护腕]], 
	},
	[85] = {
 		["key_name"]=85,
		["name"]=[[极光道戒]], 
	},
	[86] = {
 		["key_name"]=86,
		["name"]=[[极光腰带]], 
	},
	[87] = {
 		["key_name"]=87,
		["name"]=[[极光道靴]], 
	},
	[88] = {
 		["key_name"]=88,
		["name"]=[[虎啸战盔]], 
	},
	[89] = {
 		["key_name"]=89,
		["name"]=[[虎啸战链]], 
	},
	[90] = {
 		["key_name"]=90,
		["name"]=[[虎啸战镯]], 
	},
	[91] = {
 		["key_name"]=91,
		["name"]=[[虎啸战戒]], 
	},
	[92] = {
 		["key_name"]=92,
		["name"]=[[虎啸战带]], 
	},
	[93] = {
 		["key_name"]=93,
		["name"]=[[虎啸战靴]], 
	},
	[94] = {
 		["key_name"]=94,
		["name"]=[[聚魔法冠]], 
	},
	[95] = {
 		["key_name"]=95,
		["name"]=[[聚魔法链]], 
	},
	[96] = {
 		["key_name"]=96,
		["name"]=[[聚魔法镯]], 
	},
	[97] = {
 		["key_name"]=97,
		["name"]=[[聚魔法戒]], 
	},
	[98] = {
 		["key_name"]=98,
		["name"]=[[聚魔法带]], 
	},
	[99] = {
 		["key_name"]=99,
		["name"]=[[聚魔法靴]], 
	},
	[100] = {
 		["key_name"]=100,
		["name"]=[[暗咒道盔]], 
	},
	[101] = {
 		["key_name"]=101,
		["name"]=[[暗咒道链]], 
	},
	[102] = {
 		["key_name"]=102,
		["name"]=[[暗咒道镯]], 
	},
	[103] = {
 		["key_name"]=103,
		["name"]=[[暗咒道戒]], 
	},
	[104] = {
 		["key_name"]=104,
		["name"]=[[暗咒道带]], 
	},
	[105] = {
 		["key_name"]=105,
		["name"]=[[暗咒道靴]], 
	},
	[106] = {
 		["key_name"]=106,
		["name"]=[[霸王战盔]], 
	},
	[107] = {
 		["key_name"]=107,
		["name"]=[[霸王战链]], 
	},
	[108] = {
 		["key_name"]=108,
		["name"]=[[霸王战镯]], 
	},
	[109] = {
 		["key_name"]=109,
		["name"]=[[霸王战戒]], 
	},
	[110] = {
 		["key_name"]=110,
		["name"]=[[霸王战带]], 
	},
	[111] = {
 		["key_name"]=111,
		["name"]=[[霸王战靴]], 
	},
	[112] = {
 		["key_name"]=112,
		["name"]=[[聚魂魔盔]], 
	},
	[113] = {
 		["key_name"]=113,
		["name"]=[[聚魂魔链]], 
	},
	[114] = {
 		["key_name"]=114,
		["name"]=[[聚魂魔镯]], 
	},
	[115] = {
 		["key_name"]=115,
		["name"]=[[聚魂魔戒]], 
	},
	[116] = {
 		["key_name"]=116,
		["name"]=[[聚魂魔带]], 
	},
	[117] = {
 		["key_name"]=117,
		["name"]=[[聚魂魔靴]], 
	},
	[118] = {
 		["key_name"]=118,
		["name"]=[[天机道盔]], 
	},
	[119] = {
 		["key_name"]=119,
		["name"]=[[天机道链]], 
	},
	[120] = {
 		["key_name"]=120,
		["name"]=[[天机道镯]], 
	},
	[121] = {
 		["key_name"]=121,
		["name"]=[[天机道戒]], 
	},
	[122] = {
 		["key_name"]=122,
		["name"]=[[天机道带]], 
	},
	[123] = {
 		["key_name"]=123,
		["name"]=[[天机道靴]], 
	},
	[124] = {
 		["key_name"]=124,
		["name"]=[[刑天战盔]], 
	},
	[125] = {
 		["key_name"]=125,
		["name"]=[[刑天战链]], 
	},
	[126] = {
 		["key_name"]=126,
		["name"]=[[刑天战镯]], 
	},
	[127] = {
 		["key_name"]=127,
		["name"]=[[刑天战戒]], 
	},
	[128] = {
 		["key_name"]=128,
		["name"]=[[刑天战带]], 
	},
	[129] = {
 		["key_name"]=129,
		["name"]=[[刑天战靴]], 
	},
	[130] = {
 		["key_name"]=130,
		["name"]=[[祝融法盔]], 
	},
	[131] = {
 		["key_name"]=131,
		["name"]=[[祝融法链]], 
	},
	[132] = {
 		["key_name"]=132,
		["name"]=[[祝融法镯]], 
	},
	[133] = {
 		["key_name"]=133,
		["name"]=[[祝融法戒]], 
	},
	[134] = {
 		["key_name"]=134,
		["name"]=[[祝融法带]], 
	},
	[135] = {
 		["key_name"]=135,
		["name"]=[[祝融法靴]], 
	},
	[136] = {
 		["key_name"]=136,
		["name"]=[[阴阳道盔]], 
	},
	[137] = {
 		["key_name"]=137,
		["name"]=[[阴阳道链]], 
	},
	[138] = {
 		["key_name"]=138,
		["name"]=[[阴阳道镯]], 
	},
	[139] = {
 		["key_name"]=139,
		["name"]=[[阴阳道戒]], 
	},
	[140] = {
 		["key_name"]=140,
		["name"]=[[阴阳道带]], 
	},
	[141] = {
 		["key_name"]=141,
		["name"]=[[阴阳道靴]], 
	},
	[142] = {
 		["key_name"]=142,
		["name"]=[[天赐战盔]], 
	},
	[143] = {
 		["key_name"]=143,
		["name"]=[[天赐战链]], 
	},
	[144] = {
 		["key_name"]=144,
		["name"]=[[天赐战镯]], 
	},
	[145] = {
 		["key_name"]=145,
		["name"]=[[天赐战戒]], 
	},
	[146] = {
 		["key_name"]=146,
		["name"]=[[天赐战带]], 
	},
	[147] = {
 		["key_name"]=147,
		["name"]=[[天赐战靴]], 
	},
	[148] = {
 		["key_name"]=148,
		["name"]=[[麒麟魔盔]], 
	},
	[149] = {
 		["key_name"]=149,
		["name"]=[[麒麟魔链]], 
	},
	[150] = {
 		["key_name"]=150,
		["name"]=[[麒麟魔镯]], 
	},
	[151] = {
 		["key_name"]=151,
		["name"]=[[麒麟魔戒]], 
	},
	[152] = {
 		["key_name"]=152,
		["name"]=[[麒麟魔带]], 
	},
	[153] = {
 		["key_name"]=153,
		["name"]=[[麒麟魔靴]], 
	},
	[154] = {
 		["key_name"]=154,
		["name"]=[[无极道盔]], 
	},
	[155] = {
 		["key_name"]=155,
		["name"]=[[无极道链]], 
	},
	[156] = {
 		["key_name"]=156,
		["name"]=[[无极道镯]], 
	},
	[157] = {
 		["key_name"]=157,
		["name"]=[[无极道戒]], 
	},
	[158] = {
 		["key_name"]=158,
		["name"]=[[无极道带]], 
	},
	[159] = {
 		["key_name"]=159,
		["name"]=[[无极道靴]], 
	},
	[160] = {
 		["key_name"]=160,
		["name"]=[[龙吟战盔]], 
	},
	[161] = {
 		["key_name"]=161,
		["name"]=[[龙吟战链]], 
	},
	[162] = {
 		["key_name"]=162,
		["name"]=[[龙吟战镯]], 
	},
	[163] = {
 		["key_name"]=163,
		["name"]=[[龙吟战戒]], 
	},
	[164] = {
 		["key_name"]=164,
		["name"]=[[龙吟战带]], 
	},
	[165] = {
 		["key_name"]=165,
		["name"]=[[龙吟战靴]], 
	},
	[166] = {
 		["key_name"]=166,
		["name"]=[[修罗魔盔]], 
	},
	[167] = {
 		["key_name"]=167,
		["name"]=[[修罗魔链]], 
	},
	[168] = {
 		["key_name"]=168,
		["name"]=[[修罗魔镯]], 
	},
	[169] = {
 		["key_name"]=169,
		["name"]=[[修罗魔戒]], 
	},
	[170] = {
 		["key_name"]=170,
		["name"]=[[修罗魔带]], 
	},
	[171] = {
 		["key_name"]=171,
		["name"]=[[修罗魔靴]], 
	},
	[172] = {
 		["key_name"]=172,
		["name"]=[[仙风道盔]], 
	},
	[173] = {
 		["key_name"]=173,
		["name"]=[[仙风道链]], 
	},
	[174] = {
 		["key_name"]=174,
		["name"]=[[仙风道镯]], 
	},
	[175] = {
 		["key_name"]=175,
		["name"]=[[仙风道戒]], 
	},
	[176] = {
 		["key_name"]=176,
		["name"]=[[仙风道带]], 
	},
	[177] = {
 		["key_name"]=177,
		["name"]=[[仙风道靴]], 
	},
	[178] = {
 		["key_name"]=178,
		["name"]=[[奔雷战甲(男)]], 
	},
	[179] = {
 		["key_name"]=179,
		["name"]=[[奔雷战甲(女)]], 
	},
	[180] = {
 		["key_name"]=180,
		["name"]=[[怒焰魔衣(男)]], 
	},
	[181] = {
 		["key_name"]=181,
		["name"]=[[怒焰魔衣(女)]], 
	},
	[182] = {
 		["key_name"]=182,
		["name"]=[[极光道袍(男)]], 
	},
	[183] = {
 		["key_name"]=183,
		["name"]=[[极光道袍(女)]], 
	},  
}
 return config;