---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]=[[传承·I]],
		["end_arr0"]={"英雄战盔","英雄战链","英雄战镯","英雄战戒","英雄战带","英雄战靴",},
		["need_arr0"]={"武圣战盔","武圣战链","武圣战镯","武圣战戒","武圣战带","武圣战靴",},
		["end_arr1"]={"魔灵法盔","魔灵法链","魔灵法镯","魔灵法戒","魔灵法带","魔灵法靴",},
		["need_arr1"]={"雷神魔盔","雷神魔链","雷神魔镯","雷神魔戒","雷神魔带","雷神魔靴",},
		["end_arr2"]={"阐释道盔","阐释道链","阐释道镯","阐释道戒","阐释道带","阐释道靴",},
		["need_arr2"]={"泰坦道盔","泰坦道链","泰坦道镯","泰坦道戒","泰坦道带","泰坦道靴",},
		["number_arr"]={1,0,0,},
		["itemName1"]=[[仙石]],
		["itemCount1"]=99, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]=[[传承·II]],
		["end_arr0"]={"赤龙战盔","赤龙战链","赤龙战镯","赤龙战戒","赤龙战带","赤龙战靴",},
		["need_arr0"]={"英雄战盔","英雄战链","英雄战镯","英雄战戒","英雄战带","英雄战靴",},
		["end_arr1"]={"追魂魔盔","追魂魔链","追魂魔镯","追魂魔戒","追魂魔带","追魂魔靴",},
		["need_arr1"]={"魔灵法盔","魔灵法链","魔灵法镯","魔灵法戒","魔灵法带","魔灵法靴",},
		["end_arr2"]={"昆仑道盔","昆仑道链","昆仑道镯","昆仑道戒","昆仑道带","昆仑道靴",},
		["need_arr2"]={"阐释道盔","阐释道链","阐释道镯","阐释道戒","阐释道带","阐释道靴",},
		["number_arr"]={1,0,0,},
		["itemName1"]=[[仙石]],
		["itemCount1"]=199, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]=[[传承·III]],
		["end_arr0"]={"阎罗战盔","阎罗战链","阎罗战镯","阎罗战戒","阎罗战带","阎罗战靴",},
		["need_arr0"]={"赤龙战盔","赤龙战链","赤龙战镯","赤龙战戒","赤龙战带","赤龙战靴",},
		["end_arr1"]={"毁灭魔盔","毁灭魔链","毁灭魔镯","毁灭魔戒","毁灭魔带","毁灭魔靴",},
		["need_arr1"]={"追魂魔盔","追魂魔链","追魂魔镯","追魂魔戒","追魂魔带","追魂魔靴",},
		["end_arr2"]={"避邪道盔","避邪道链","避邪道镯","避邪道戒","避邪道带","避邪道靴",},
		["need_arr2"]={"昆仑道盔","昆仑道链","昆仑道镯","昆仑道戒","昆仑道带","昆仑道靴",},
		["number_arr"]={1,0,0,},
		["itemName1"]=[[仙石]],
		["itemCount1"]=399, 
	},  
}
 return config;