---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["drop_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔靴子","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂靴子",},
		["drop1_arr"]={"开天","镇天","玄天",},
		["x"]=163,
		["y"]=34,
		["range"]=4,
		["ceshi_arr"]={"圣战头盔","圣战项链","圣战手镯","圣战戒指","雷霆项链","雷霆护腕","雷霆战戒","雷霆腰带","雷霆战靴","战神项链","战神手镯","战神戒指","战神腰带","战神靴子","奔雷项链","奔雷手镯","奔雷戒指","奔雷腰带","奔雷靴子",},
		["ceshi2_arr"]={"裁决之杖","命运之刃","怒斩","屠龙","黄金屠龙","开天","战神盔甲(男)","战神盔甲(女)","天魔神甲","圣战宝甲","上古神甲","上古宝甲","雷霆战甲(男)","雷霆战甲(女)",}, 
	},
	[2] = {
 		["key_name"]=2,
		["drop_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔靴子","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂靴子","奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴",},
		["drop1_arr"]={"开天","镇天","玄天","祖玛裁决","祖玛骨玉","祖玛龙纹",},
		["x"]=171,
		["y"]=30,
		["range"]=3,
		["ceshi_arr"]={"虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴",},
		["ceshi2_arr"]={"虎啸战甲(男)","霸王战甲(男)","刑天战甲(男)","天赐战甲(男)","祖玛裁决","神圣屠龙","流光斧","月光斩",}, 
	},
	[3] = {
 		["key_name"]=3,
		["drop_arr"]={"奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴","虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴",},
		["drop1_arr"]={"开天","镇天","玄天","祖玛裁决","祖玛骨玉","祖玛龙纹","神圣屠龙","神圣嗜魂","神圣逍遥扇",},
		["x"]=174,
		["y"]=41,
		["range"]=4,
		["ceshi_arr"]={"天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴",},
		["ceshi2_arr"]={"月光斩","天赐战甲(男)","阎魔","龙吟战甲(男)","鬼王","啸天战甲(男)",}, 
	},
	[4] = {
 		["key_name"]=4,
		["drop_arr"]={"奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴","虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴","霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴",},
		["drop1_arr"]={"开天","镇天","玄天","祖玛裁决","祖玛骨玉","祖玛龙纹","神圣屠龙","神圣嗜魂","神圣逍遥扇","流光斧","聚魔法杖","天机棍",},
		["x"]=171,
		["y"]=30,
		["range"]=3,
		["ceshi_arr"]={"啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","追日战盔","追日战链","追日战镯","追日战戒","追日战带","金刚战盔","金刚战链","金刚战镯","金刚战戒","金刚战带","金刚战靴","破坏战盔","破坏战链","破坏战镯","破坏战戒","破坏战带","破坏战靴","追日战甲(男)",},
		["ceshi2_arr"]={"鬼王","啸天战甲(男)","金刚战甲(男)","破坏战甲(男)","狂雷","破魔","耀光",}, 
	},  
}
 return config;