---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["drop_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔靴子","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂靴子","奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","怒焰项链","怒焰护腕","怒焰魔戒","怒焰腰带","怒焰魔靴","极光项链","极光护腕","极光道戒","极光腰带","极光道靴","虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","聚魔法冠","聚魔法链","聚魔法镯","聚魔法戒","聚魔法带","聚魔法靴","暗咒道盔","暗咒道链","暗咒道镯","暗咒道戒","暗咒道带","暗咒道靴","霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴","聚魂魔盔","聚魂魔链","聚魂魔镯","聚魂魔戒","聚魂魔带","聚魂魔靴","天机道盔","天机道链","天机道镯","天机道戒","天机道带","天机道靴",},
		["drop1_arr"]={"黄金屠龙","雷霆战甲(男)","雷霆战甲(女)","紫金嗜魂法杖","烈焰魔衣(男)","烈焰魔衣(女)","赤金逍遥扇","光芒道袍(男)","光芒道袍(女)","开天","奔雷战甲(男)","奔雷战甲(女)","镇天","怒焰魔衣(男)","怒焰魔衣(女)","玄天","极光道袍(男)","极光道袍(女)","祖玛裁决","虎啸战甲(男)","虎啸战甲(女)","祖玛骨玉","聚魔法衣(男)","聚魔法衣(女)","祖玛龙纹","暗咒道袍(男)","暗咒道袍(女)","神圣屠龙","霸王战甲(男)","霸王战甲(女)","神圣嗜魂","离魂魔衣(男)","离魂魔衣(女)","神圣逍遥扇","天机道袍(男)","天机道袍(女)",},
		["x"]=163,
		["y"]=34,
		["range"]=4,
		["ceshi_arr"]={"战神项链","战神手镯","战神戒指","战神腰带","战神靴子","奔雷项链","奔雷护腕","奔雷战戒","奔雷腰带","奔雷战靴","虎啸战盔","虎啸战链","虎啸战镯","虎啸战戒","虎啸战带","虎啸战靴","霸王战盔","霸王战链","霸王战镯","霸王战戒","霸王战带","霸王战靴",},
		["ceshi2_arr"]={"黄金屠龙","雷霆战甲(男)","雷霆战甲(女)","开天","奔雷战甲(男)","奔雷战甲(女)","祖玛裁决","虎啸战甲(男)","虎啸战甲(女)","神圣屠龙","霸王战甲(男)","霸王战甲(女)",}, 
		["mon"]={"僵尸王·十万倍爆率", "僵尸王·万倍爆率", "僵尸王·千倍爆率", "僵尸王·百倍爆率", "僵尸王·十倍爆率"},
	},
	[2] = {
 		["key_name"]=2,
		["drop_arr"]={"刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","祝融法盔","祝融法链","祝融法镯","祝融法戒","祝融法带","祝融法靴","天机棍","阴阳道盔","阴阳道链","阴阳道镯","阴阳道戒","阴阳道带","阴阳道靴","天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","麒麟魔盔","麒麟魔链","麒麟魔镯","麒麟魔戒","麒麟魔带","麒麟魔靴","无极道盔","无极道链","无极道镯","无极道戒","无极道带","无极道靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴",},
		["drop1_arr"]={"流光斧","刑天战甲(男)","刑天战甲(女)","聚魔法杖","祝融魔衣(男)","祝融魔衣(女)","天机棍","阴阳道袍(男)","阴阳道袍(女)","月光斩","天赐战甲(男)","天赐战甲(女)","离魂魔杖","麒麟魔衣(男)","麒麟魔衣(女)","封魔剑","无极道袍(男)","无极道袍(女)","阎魔","龙吟战甲(男)","龙吟战甲(女)","天神法杖","修罗魔衣(男)","修罗魔衣(女)","银蛇剑","仙风道袍(男)","仙风道袍(女)","鬼王","啸天战甲(男)","啸天战甲(女)","七彩魔刃","暗月魔衣(男)","暗月魔衣(女)","破魂剑","太玄道袍(男)","太玄道袍(女)",},
		["x"]=171,
		["y"]=30,
		["range"]=3,
		["ceshi_arr"]={"刑天战盔","刑天战链","刑天战镯","刑天战戒","刑天战带","刑天战靴","天赐战盔","天赐战链","天赐战镯","天赐战戒","天赐战带","天赐战靴","龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","流光斧","刑天战甲(男)","刑天战甲(女)",},
		["ceshi2_arr"]={"流光斧","刑天战甲(男)","刑天战甲(女)","月光斩","天赐战甲(男)","天赐战甲(女)","阎魔","龙吟战甲(男)","龙吟战甲(女)","鬼王","啸天战甲(男)","啸天战甲(女)",}, 
		["mon"]={"僵尸王·十万倍爆率", "僵尸王·万倍爆率", "僵尸王·千倍爆率", "僵尸王·百倍爆率", "僵尸王·十倍爆率"},
	},
	[3] = {
 		["key_name"]=3,
		["drop_arr"]={"龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","修罗魔盔","修罗魔链","修罗魔镯","修罗魔戒","修罗魔带","修罗魔靴","仙风道盔","仙风道链","仙风道镯","仙风道戒","仙风道带","仙风道靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴","追日战盔","追日战链","追日战镯","追日战戒","追日战带","追日战靴","揽月魔盔","揽月魔链","揽月魔镯","揽月魔戒","揽月魔带","揽月魔靴","摘星道盔","摘星道链","摘星道镯","摘星道戒","摘星道带","摘星道靴",},
		["drop1_arr"]={"阎魔","龙吟战甲(男)","龙吟战甲(女)","天神法杖","修罗魔衣(男)","修罗魔衣(女)","银蛇剑","仙风道袍(男)","仙风道袍(女)","鬼王","啸天战甲(男)","啸天战甲(女)","七彩魔刃","暗月魔衣(男)","暗月魔衣(女)","破魂剑","太玄道袍(男)","太玄道袍(女)","狂雷","追日战甲(男)","追日战甲(女)","千年玄冰","揽月法衣(男)","揽月法衣(女)","太乙羽","摘星道袍(男)","摘星道袍(女)",},
		["x"]=174,
		["y"]=41,
		["range"]=4,
		["ceshi_arr"]={"龙吟战盔","龙吟战链","龙吟战镯","龙吟战戒","龙吟战带","龙吟战靴","啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","追日战盔","追日战链","追日战镯","追日战戒","追日战带","追日战靴",},
		["ceshi2_arr"]={"阎魔","龙吟战甲(男)","龙吟战甲(女)","鬼王","啸天战甲(男)","啸天战甲(女)","狂雷","追日战甲(男)","追日战甲(女)",}, 
		["mon"]={"僵尸王·十万倍爆率", "僵尸王·万倍爆率", "僵尸王·千倍爆率", "僵尸王·百倍爆率", "僵尸王·十倍爆率"},
	},
	[4] = {
 		["key_name"]=4,
		["drop_arr"]={"啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","暗月魔盔","暗月魔链","暗月魔镯","暗月魔戒","暗月魔带","暗月魔靴","太玄道盔","太玄道链","太玄道镯","太玄道戒","太玄道带","太玄道靴","追日战盔","追日战链","追日战镯","追日战戒","追日战带","追日战靴","揽月魔盔","揽月魔链","揽月魔镯","揽月魔戒","揽月魔带","揽月魔靴","摘星道盔","摘星道链","摘星道镯","摘星道戒","摘星道带","摘星道靴","金刚战盔","金刚战链","金刚战镯","金刚战戒","金刚战带","金刚战靴","五行魔盔","五行魔链","五行魔镯","五行魔戒","五行魔带","五行魔靴","神谕道盔","神谕道链","神谕道镯","神谕道戒","神谕道带","神谕道靴",},
		["drop1_arr"]={"狂雷","追日战甲(男)","追日战甲(女)","千年玄冰","揽月法衣(男)","揽月法衣(女)","太乙羽","摘星道袍(男)","摘星道袍(女)","破魔","金刚战甲(男)","金刚战甲(女)","霜之魂","五行法衣(男)","五行法衣(女)","龙鳞羽","神谕道袍(男)","神谕道袍(女)",},
		["x"]=171,
		["y"]=30,
		["range"]=3,
		["ceshi_arr"]={"啸天战盔","啸天战链","啸天战镯","啸天战戒","啸天战带","啸天战靴","追日战盔","追日战链","追日战镯","追日战戒","追日战带","追日战靴","金刚战盔","金刚战链","金刚战镯","金刚战戒","金刚战带","金刚战靴",},
		["ceshi2_arr"]={"鬼王","啸天战甲(男)","啸天战甲(女)","狂雷","追日战甲(男)","追日战甲(女)","破魔","金刚战甲(男)","金刚战甲(女)",}, 
		["mon"]={"僵尸王·十万倍爆率", "僵尸王·万倍爆率", "僵尸王·千倍爆率", "僵尸王·百倍爆率", "僵尸王·十倍爆率"},
	},  
}
 return config;