---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["天降财宝"] = {
 		["key_name"]=[[天降财宝]],
		["var"]=1, 
	},
	["激情派对"] = {
 		["key_name"]=[[激情派对]],
		["var"]=1, 
	},
	["武林至尊"] = {
 		["key_name"]=[[武林至尊]],
		["var"]=1, 
	},
	["夺宝奇兵"] = {
 		["key_name"]=[[夺宝奇兵]],
		["var"]=1, 
	},
	["世界BOSS"] = {
 		["key_name"]=[[世界BOSS]],
		["var"]=1, 
	},
	["行会战场"] = {
 		["key_name"]=[[行会战场]],
		["var"]=1, 
	},
	["乱斗之王1"] = {
 		["key_name"]=[[乱斗之王1]],
		["var"]=1, 
	},
	["乱斗之王2"] = {
 		["key_name"]=[[乱斗之王2]],
		["var"]=1, 
	},
	["乱斗之王3"] = {
 		["key_name"]=[[乱斗之王3]],
		["var"]=1, 
	},
	["乱斗之王4"] = {
 		["key_name"]=[[乱斗之王4]],
		["var"]=1, 
	},
	["乱斗之王5"] = {
 		["key_name"]=[[乱斗之王5]],
		["var"]=1, 
	},
	["乱斗之王6"] = {
 		["key_name"]=[[乱斗之王6]],
		["var"]=1, 
	},
	["乱斗之王7"] = {
 		["key_name"]=[[乱斗之王7]],
		["var"]=1, 
	},
	["乱斗之王8"] = {
 		["key_name"]=[[乱斗之王8]],
		["var"]=1, 
	},
	["乱斗之王9"] = {
 		["key_name"]=[[乱斗之王9]],
		["var"]=1, 
	},
	["乱斗之王10"] = {
 		["key_name"]=[[乱斗之王10]],
		["var"]=1, 
	},
	["乱斗之王11"] = {
 		["key_name"]=[[乱斗之王11]],
		["var"]=1, 
	},
	["乱斗之王12"] = {
 		["key_name"]=[[乱斗之王12]],
		["var"]=1, 
	},
	["乱斗之王13"] = {
 		["key_name"]=[[乱斗之王13]],
		["var"]=1, 
	},
	["乱斗之王14"] = {
 		["key_name"]=[[乱斗之王14]],
		["var"]=1, 
	},
	["乱斗之王15"] = {
 		["key_name"]=[[乱斗之王15]],
		["var"]=1, 
	},
	["乱斗之王16"] = {
 		["key_name"]=[[乱斗之王16]],
		["var"]=1, 
	},
	["乱斗之王17"] = {
 		["key_name"]=[[乱斗之王17]],
		["var"]=1, 
	},
	["乱斗之王18"] = {
 		["key_name"]=[[乱斗之王18]],
		["var"]=1, 
	},
	["狂暴霸主"] = {
 		["key_name"]=[[狂暴霸主]],
		["var"]=1, 
	},
	["天降财宝kf"] = {
 		["key_name"]=[[天降财宝kf]],
		["var"]=1, 
	},
	["激情派对kf"] = {
 		["key_name"]=[[激情派对kf]],
		["var"]=1, 
	},
	["武林至尊kf"] = {
 		["key_name"]=[[武林至尊kf]],
		["var"]=1, 
	},
	["夺宝奇兵kf"] = {
 		["key_name"]=[[夺宝奇兵kf]],
		["var"]=1, 
	},
	["世界bosskf"] = {
 		["key_name"]=[[世界bosskf]],
		["var"]=1, 
	},
	["行会战场kf"] = {
 		["key_name"]=[[行会战场kf]],
		["var"]=1, 
	},
	["乱斗之王1kf"] = {
 		["key_name"]=[[乱斗之王1kf]],
		["var"]=1, 
	},
	["乱斗之王2kf"] = {
 		["key_name"]=[[乱斗之王2kf]],
		["var"]=1, 
	},
	["乱斗之王3kf"] = {
 		["key_name"]=[[乱斗之王3kf]],
		["var"]=1, 
	},
	["乱斗之王4kf"] = {
 		["key_name"]=[[乱斗之王4kf]],
		["var"]=1, 
	},
	["乱斗之王5kf"] = {
 		["key_name"]=[[乱斗之王5kf]],
		["var"]=1, 
	},
	["乱斗之王6kf"] = {
 		["key_name"]=[[乱斗之王6kf]],
		["var"]=1, 
	},
	["乱斗之王7kf"] = {
 		["key_name"]=[[乱斗之王7kf]],
		["var"]=1, 
	},
	["乱斗之王8kf"] = {
 		["key_name"]=[[乱斗之王8kf]],
		["var"]=1, 
	},
	["乱斗之王9kf"] = {
 		["key_name"]=[[乱斗之王9kf]],
		["var"]=1, 
	},
	["乱斗之王10kf"] = {
 		["key_name"]=[[乱斗之王10kf]],
		["var"]=1, 
	},
	["乱斗之王11kf"] = {
 		["key_name"]=[[乱斗之王11kf]],
		["var"]=1, 
	},
	["乱斗之王12kf"] = {
 		["key_name"]=[[乱斗之王12kf]],
		["var"]=1, 
	},
	["乱斗之王13kf"] = {
 		["key_name"]=[[乱斗之王13kf]],
		["var"]=1, 
	},
	["乱斗之王14kf"] = {
 		["key_name"]=[[乱斗之王14kf]],
		["var"]=1, 
	},
	["乱斗之王15kf"] = {
 		["key_name"]=[[乱斗之王15kf]],
		["var"]=1, 
	},
	["乱斗之王16kf"] = {
 		["key_name"]=[[乱斗之王16kf]],
		["var"]=1, 
	},
	["乱斗之王17kf"] = {
 		["key_name"]=[[乱斗之王17kf]],
		["var"]=1, 
	},
	["乱斗之王18kf"] = {
 		["key_name"]=[[乱斗之王18kf]],
		["var"]=1, 
	},
	["狂暴霸主kf"] = {
 		["key_name"]=[[狂暴霸主kf]],
		["var"]=1, 
	},
	["深渊禁地1"] = {
 		["key_name"]=[[深渊禁地1]],
		["var"]=1, 
	},
	["深渊禁地2"] = {
 		["key_name"]=[[深渊禁地2]],
		["var"]=1, 
	},
	["深渊禁地3"] = {
 		["key_name"]=[[深渊禁地3]],
		["var"]=1, 
	},
	["深渊禁地4"] = {
 		["key_name"]=[[深渊禁地4]],
		["var"]=1, 
	},
	["深渊禁地5"] = {
 		["key_name"]=[[深渊禁地5]],
		["var"]=1, 
	},
	["深渊禁地6"] = {
 		["key_name"]=[[深渊禁地6]],
		["var"]=1, 
	},
	["深渊禁地7"] = {
 		["key_name"]=[[深渊禁地7]],
		["var"]=1, 
	},
	["深渊禁地8"] = {
 		["key_name"]=[[深渊禁地8]],
		["var"]=1, 
	},
	["深渊禁地9"] = {
 		["key_name"]=[[深渊禁地9]],
		["var"]=1, 
	},
	["深渊禁地10"] = {
 		["key_name"]=[[深渊禁地10]],
		["var"]=1, 
	},
	["深渊禁地11"] = {
 		["key_name"]=[[深渊禁地11]],
		["var"]=1, 
	},
	["深渊禁地12"] = {
 		["key_name"]=[[深渊禁地12]],
		["var"]=1, 
	},
	["世界战场1"] = {
 		["key_name"]=[[世界战场1]],
		["var"]=1, 
	},
	["世界战场2"] = {
 		["key_name"]=[[世界战场2]],
		["var"]=1, 
	},
	["世界战场3"] = {
 		["key_name"]=[[世界战场3]],
		["var"]=1, 
	},
	["世界战场4"] = {
 		["key_name"]=[[世界战场4]],
		["var"]=1, 
	},
	["世界战场5"] = {
 		["key_name"]=[[世界战场5]],
		["var"]=1, 
	},
	["世界战场6"] = {
 		["key_name"]=[[世界战场6]],
		["var"]=1, 
	},
	["世界战场7"] = {
 		["key_name"]=[[世界战场7]],
		["var"]=1, 
	},
	["世界战场8"] = {
 		["key_name"]=[[世界战场8]],
		["var"]=1, 
	},
	["世界战场9"] = {
 		["key_name"]=[[世界战场9]],
		["var"]=1, 
	},
	["跨服领域1"] = {
 		["key_name"]=[[跨服领域1]],
		["var"]=1, 
	},
	["跨服领域2"] = {
 		["key_name"]=[[跨服领域2]],
		["var"]=1, 
	},
	["跨服领域3"] = {
 		["key_name"]=[[跨服领域3]],
		["var"]=1, 
	},
	["跨服领域4"] = {
 		["key_name"]=[[跨服领域4]],
		["var"]=1, 
	},
	["跨服领域5"] = {
 		["key_name"]=[[跨服领域5]],
		["var"]=1, 
	},
	["跨服领域6"] = {
 		["key_name"]=[[跨服领域6]],
		["var"]=1, 
	},
	["跨服领域7"] = {
 		["key_name"]=[[跨服领域7]],
		["var"]=1, 
	},
	["宝藏禁地"] = {
 		["key_name"]=[[宝藏禁地]],
		["var"]=1, 
	},
	["七星宫殿"] = {
 		["key_name"]=[[七星宫殿]],
		["var"]=1, 
	},
	["终极之地"] = {
 		["key_name"]=[[终极之地]],
		["var"]=1, 
	},
	["精绝遗迹"] = {
 		["key_name"]=[[精绝遗迹]],
		["var"]=1, 
	},
	["魔国圣殿"] = {
 		["key_name"]=[[魔国圣殿]],
		["var"]=1, 
	},
	["藏宝大殿"] = {
 		["key_name"]=[[藏宝大殿]],
		["var"]=1, 
	},
	["藏宝神庙"] = {
 		["key_name"]=[[藏宝神庙]],
		["var"]=1, 
	},
	["巅峰等待kf"] = {
 		["key_name"]=[[巅峰等待kf]],
		["var"]=1, 
	},
	["巅峰峡谷kf"] = {
 		["key_name"]=[[巅峰峡谷kf]],
		["var"]=1, 
	},
	["无限战场kf"] = {
 		["key_name"]=[[无限战场kf]],
		["var"]=1, 
	},
	["永夜降临1kf"] = {
 		["key_name"]=[[永夜降临1kf]],
		["var"]=1, 
	},
	["永夜降临2kf"] = {
 		["key_name"]=[[永夜降临2kf]],
		["var"]=1, 
	},
	["永夜降临3kf"] = {
 		["key_name"]=[[永夜降临3kf]],
		["var"]=1, 
	},
	["永夜降临4kf"] = {
 		["key_name"]=[[永夜降临4kf]],
		["var"]=1, 
	},
	["恶魔广场kf"] = {
 		["key_name"]=[[恶魔广场kf]],
		["var"]=1, 
	},
	["九层妖塔1"] = {
 		["key_name"]=[[九层妖塔1]],
		["var"]=1, 
	},
	["九层妖塔2"] = {
 		["key_name"]=[[九层妖塔2]],
		["var"]=1, 
	},
	["九层妖塔3"] = {
 		["key_name"]=[[九层妖塔3]],
		["var"]=1, 
	},
	["九层妖塔4"] = {
 		["key_name"]=[[九层妖塔4]],
		["var"]=1, 
	},
	["九层妖塔5"] = {
 		["key_name"]=[[九层妖塔5]],
		["var"]=1, 
	},
	["九层妖塔6"] = {
 		["key_name"]=[[九层妖塔6]],
		["var"]=1, 
	},
	["九层妖塔7"] = {
 		["key_name"]=[[九层妖塔7]],
		["var"]=1, 
	},
	["九层妖塔8"] = {
 		["key_name"]=[[九层妖塔8]],
		["var"]=1, 
	},
	["九层妖塔9"] = {
 		["key_name"]=[[九层妖塔9]],
		["var"]=1, 
	},
	["九层妖塔10"] = {
 		["key_name"]=[[九层妖塔10]],
		["var"]=1, 
	},
	["风暴壁垒kf"] = {
 		["key_name"]=[[风暴壁垒kf]],
		["var"]=1, 
	},
	["龙柩地宫kf"] = {
 		["key_name"]=[[龙柩地宫kf]],
		["var"]=1, 
	},
	["遗忘书冢kf"] = {
 		["key_name"]=[[遗忘书冢kf]],
		["var"]=1, 
	},
	["星璇迷宫kf"] = {
 		["key_name"]=[[星璇迷宫kf]],
		["var"]=1, 
	},
	["毒龙深渊kf"] = {
 		["key_name"]=[[毒龙深渊kf]],
		["var"]=1, 
	},
	["巫祭禁地kf"] = {
 		["key_name"]=[[巫祭禁地kf]],
		["var"]=1, 
	},
	["瘴雾沼泽kf"] = {
 		["key_name"]=[[瘴雾沼泽kf]],
		["var"]=1, 
	},
	["冰晶回廊kf"] = {
 		["key_name"]=[[冰晶回廊kf]],
		["var"]=1, 
	},
	["遗骸禁区kf"] = {
 		["key_name"]=[[遗骸禁区kf]],
		["var"]=1, 
	},
	["风暴禁地王座"] = {
 		["key_name"]=[[风暴禁地王座]],
		["var"]=1, 
	},
	["风暴血渊之巅"] = {
 		["key_name"]=[[风暴血渊之巅]],
		["var"]=1, 
	},
	["风暴神庙祭坛"] = {
 		["key_name"]=[[风暴神庙祭坛]],
		["var"]=1, 
	},
	["风暴地牢秘境"] = {
 		["key_name"]=[[风暴地牢秘境]],
		["var"]=1, 
	},
	["风暴山谷祭坛"] = {
 		["key_name"]=[[风暴山谷祭坛]],
		["var"]=1, 
	},
	["雪原峡谷暗殿"] = {
 		["key_name"]=[[雪原峡谷暗殿]],
		["var"]=1, 
	},
	["雪原密道圣殿"] = {
 		["key_name"]=[[雪原密道圣殿]],
		["var"]=1, 
	},
	["雪原宫殿王座"] = {
 		["key_name"]=[[雪原宫殿王座]],
		["var"]=1, 
	},
	["雪原古堡魔宫"] = {
 		["key_name"]=[[雪原古堡魔宫]],
		["var"]=1, 
	},
	["蛮荒血域幻境"] = {
 		["key_name"]=[[蛮荒血域幻境]],
		["var"]=1, 
	},
	["蛮荒荒漠祭坛"] = {
 		["key_name"]=[[蛮荒荒漠祭坛]],
		["var"]=1, 
	},
	["蛮荒古城天宫"] = {
 		["key_name"]=[[蛮荒古城天宫]],
		["var"]=1, 
	},
	["蛮荒神庙王座"] = {
 		["key_name"]=[[蛮荒神庙王座]],
		["var"]=1, 
	},
	["蛮荒暗殿禁地"] = {
 		["key_name"]=[[蛮荒暗殿禁地]],
		["var"]=1, 
	},
	["蛮荒森林深渊"] = {
 		["key_name"]=[[蛮荒森林深渊]],
		["var"]=1, 
	},
	["钳虫巢穴"] = {
 		["key_name"]=[[钳虫巢穴]],
		["var"]=1, 
	},
	["死亡神殿"] = {
 		["key_name"]=[[死亡神殿]],
		["var"]=1, 
	},
	["地狱烈焰"] = {
 		["key_name"]=[[地狱烈焰]],
		["var"]=1, 
	},
	["深渊魔域"] = {
 		["key_name"]=[[深渊魔域]],
		["var"]=1, 
	},
	["堕落坟场"] = {
 		["key_name"]=[[堕落坟场]],
		["var"]=1, 
	},
	["困惑殿堂"] = {
 		["key_name"]=[[困惑殿堂]],
		["var"]=1, 
	},
	["钳虫巢穴kf"] = {
 		["key_name"]=[[钳虫巢穴kf]],
		["var"]=1, 
	},
	["死亡神殿kf"] = {
 		["key_name"]=[[死亡神殿kf]],
		["var"]=1, 
	},
	["地狱烈焰kf"] = {
 		["key_name"]=[[地狱烈焰kf]],
		["var"]=1, 
	},
	["深渊魔域kf"] = {
 		["key_name"]=[[深渊魔域kf]],
		["var"]=1, 
	},
	["堕落坟场kf"] = {
 		["key_name"]=[[堕落坟场kf]],
		["var"]=1, 
	},
	["困惑殿堂kf"] = {
 		["key_name"]=[[困惑殿堂kf]],
		["var"]=1, 
	},  
	["王的遗迹1"] = {
 		["key_name"]=[[王的遗迹1]],
		["var"]=1, 
	},  
	["王的遗迹2"] = {
 		["key_name"]=[[王的遗迹2]],
		["var"]=1, 
	},  
	["王的遗迹3"] = {
 		["key_name"]=[[王的遗迹3]],
		["var"]=1, 
	},  
	["王的遗迹4"] = {
 		["key_name"]=[[王的遗迹4]],
		["var"]=1, 
	},  
	["王的遗迹5"] = {
 		["key_name"]=[[王的遗迹5]],
		["var"]=1, 
	},  
	["王的遗迹6"] = {
 		["key_name"]=[[王的遗迹6]],
		["var"]=1, 
	},  
	["王的遗迹7"] = {
 		["key_name"]=[[王的遗迹7]],
		["var"]=1, 
	},  
	["地下矿洞"] = {
 		["key_name"]=[[地下矿洞]],
		["var"]=1, 
	},  
}
 return config;