---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]=[[客服礼包]],
		["cdk"]=[[直接领取]],
		["giveitem_map"]={["绑定元宝"]=10000,["书页"]=10,["金针"]=10,["天命石"]=3,["飞行符"]=9,["能量饮料"]=3,}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]=[[CDK礼包]],
		["cdk"]="tsz888",
		["giveitem_map"]={["白银特权激活卡"]=1,["黄金特权激活卡"]=1,["钻石特权激活卡"]=1,["冠名特权激活卡"]=1},
	},
	[3] = {
 		["key_name"]=3,
		["type"]=[[CDK礼包]],
		["cdk"]="vip666",
		["giveitem_map"]={["书页"]=10,["罗盘"]=1},
	},
	[4] = {
 		["key_name"]=4,
		["type"]=[[CDK礼包]],
		["cdk"]="vip777",
		["giveitem_map"]={["书页"]=10,["黑铁"]=30},
	},
	[5] = {
 		["key_name"]=5,
		["type"]=[[CDK礼包]],
		["cdk"]="vip888",
		["giveitem_map"]={["书页"]=10,["五行精华"]=20},
	},
}
 return config;