---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
	[2] = {
 		["key_name"]=2,
		["job0"]=[[盟重传送石#1#370&随机传送石#1#370&疗伤药#999#370]],
		["job1"]=[[盟重传送石#1#370&随机传送石#1#370&疗伤药#999#370]],
		["job2"]=[[盟重传送石#1#370&随机传送石#1#370&疗伤药#999#370]], 
	},
	[7] = {
 		["key_name"]=7,
		["item"]=[[玄铁盾#1&斗笠·Lv1#1&勋章·Lv1#1&护符·Lv1#1&军鼓·Lv1#1&血石·Lv1#1]], 
	},
	[12] = {
 		["key_name"]=12,
		["item"]=[[转生凭证#1#370]], 
	},
	[14] = {
 		["key_name"]=14,
		["item"]=[[书页#10#370]], 
	},
	[16] = {
 		["key_name"]=16,
		["item"]=[[金针#1#370]], 
	},  
}
 return config;