---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]=[[转生]],
		["item_arr"]={"转生材料",}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]=[[道具]],
		["item_arr"]={"封印魔石","深渊门票","秘境卷轴1","玛法精华1","洗练石1","仙石1","神魔材料",}, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]=[[技能书]],
		["item_arr"]={"战士技能","法师技能","道士技能",}, 
	},
	["转生材料"] = {
 		["key_name"]=[[转生材料]],
		["type"]=[[转生]],
		["item_arr"]={"2转之书","3转之书","4转之书","5转之书","6转之书","7转之书","8转之书","9转之书","10转之书",}, 
	},
	["封印魔石"] = {
 		["key_name"]=[[封印魔石]],
		["type"]=[[道具]],
		["item_arr"]={"权利魔石","力量魔石","智慧魔石","信仰魔石","精神魔石",}, 
	},
	["深渊门票"] = {
 		["key_name"]=[[深渊门票]],
		["type"]=[[道具]],
		["item_arr"]={"深渊挑战书",}, 
	},
	["秘境卷轴1"] = {
 		["key_name"]=[[秘境卷轴1]],
		["type"]=[[道具]],
		["item_arr"]={"秘境卷轴",}, 
	},
	["玛法精华1"] = {
 		["key_name"]=[[玛法精华1]],
		["type"]=[[道具]],
		["item_arr"]={"玛法精华",}, 
	},
	["洗练石1"] = {
 		["key_name"]=[[洗练石1]],
		["type"]=[[道具]],
		["item_arr"]={"洗练石",}, 
	},
	["仙石1"] = {
 		["key_name"]=[[仙石1]],
		["type"]=[[道具]],
		["item_arr"]={"仙石","上古仙石",}, 
	},
	["神魔材料"] = {
 		["key_name"]=[[神魔材料]],
		["type"]=[[道具]],
		["item_arr"]={"神之泪","魔之魂",}, 
	},
	["战士技能"] = {
 		["key_name"]=[[战士技能]],
		["type"]=[[技能书]],
		["item_arr"]={"逐日剑法","狮子吼","擒龙手","十步一杀","彻地钉",}, 
	},
	["法师技能"] = {
 		["key_name"]=[[法师技能]],
		["type"]=[[技能书]],
		["item_arr"]={"灭天火","分身术","冰霜群雨",}, 
	},
	["道士技能"] = {
 		["key_name"]=[[道士技能]],
		["type"]=[[技能书]],
		["item_arr"]={"召唤月灵","气功波","无极真气","死亡之眼",}, 
	},
	["2转之书"] = {
 		["key_name"]=[[2转之书]],
		["need_config"]={{"1转之书",2,0}}, 
	},
	["3转之书"] = {
 		["key_name"]=[[3转之书]],
		["need_config"]={{"2转之书",2,0}}, 
	},
	["4转之书"] = {
 		["key_name"]=[[4转之书]],
		["need_config"]={{"3转之书",2,0}}, 
	},
	["5转之书"] = {
 		["key_name"]=[[5转之书]],
		["need_config"]={{"4转之书",2,0}}, 
	},
	["6转之书"] = {
 		["key_name"]=[[6转之书]],
		["need_config"]={{"5转之书",2,0}}, 
	},
	["7转之书"] = {
 		["key_name"]=[[7转之书]],
		["need_config"]={{"6转之书",2,0}}, 
	},
	["8转之书"] = {
 		["key_name"]=[[8转之书]],
		["need_config"]={{"7转之书",2,0}}, 
	},
	["9转之书"] = {
 		["key_name"]=[[9转之书]],
		["need_config"]={{"8转之书",2,0}}, 
	},
	["10转之书"] = {
 		["key_name"]=[[10转之书]],
		["need_config"]={{"9转之书",2,0}}, 
	},
	["权利魔石"] = {
 		["key_name"]=[[权利魔石]],
		["need_config"]={{"结界魔石",99,0},{"金符",9999,2}}, 
	},
	["力量魔石"] = {
 		["key_name"]=[[力量魔石]],
		["need_config"]={{"结界魔石",99,0},{"金符",9999,2}}, 
	},
	["智慧魔石"] = {
 		["key_name"]=[[智慧魔石]],
		["need_config"]={{"结界魔石",99,0},{"金符",9999,2}}, 
	},
	["信仰魔石"] = {
 		["key_name"]=[[信仰魔石]],
		["need_config"]={{"结界魔石",99,0},{"金符",9999,2}}, 
	},
	["精神魔石"] = {
 		["key_name"]=[[精神魔石]],
		["need_config"]={{"结界魔石",99,0},{"金符",9999,2}}, 
	},
	["深渊挑战书"] = {
 		["key_name"]=[[深渊挑战书]],
		["need_config"]={{"秘境卷轴",10,0},{"金符",9999,2}}, 
	},
	["秘境卷轴"] = {
 		["key_name"]=[[秘境卷轴]],
		["need_config"]={{"恶魔令牌",10,0},{"金符",1000,2}}, 
	},
	["玛法精华"] = {
 		["key_name"]=[[玛法精华]],
		["need_config"]={{"祖玛水晶",10,0},{"金符",1000,2}}, 
	},
	["洗练石"] = {
 		["key_name"]=[[洗练石]],
		["need_config"]={{"黑铁",10,0},{"金符",1000,2}}, 
	},
	["仙石"] = {
 		["key_name"]=[[仙石]],
		["need_config"]={{"仙石碎片",10,0},{"金符",5000,2}}, 
	},
	["上古仙石"] = {
 		["key_name"]=[[上古仙石]],
		["need_config"]={{"仙石",100,0},{"黄金钥匙",1,0}}, 
	},
	["神之泪"] = {
 		["key_name"]=[[神之泪]],
		["need_config"]={{"洗髓丹",99,0},{"元宝",2000,2}}, 
	},
	["魔之魂"] = {
 		["key_name"]=[[魔之魂]],
		["need_config"]={{"仙石",99,0},{"元宝",2000,2}}, 
	},
	["逐日剑法"] = {
 		["key_name"]=[[逐日剑法]],
		["need_config"]={{"书页",999,0},{"金符",100000,2}}, 
	},
	["狮子吼"] = {
 		["key_name"]=[[狮子吼]],
		["need_config"]={{"书页",1888,0},{"金符",200000,2}}, 
	},
	["擒龙手"] = {
 		["key_name"]=[[擒龙手]],
		["need_config"]={{"书页",1888,0},{"金符",200000,2}}, 
	},
	["十步一杀"] = {
 		["key_name"]=[[十步一杀]],
		["need_config"]={{"书页",3888,0},{"金符",300000,2}}, 
	},
	["彻地钉"] = {
 		["key_name"]=[[彻地钉]],
		["need_config"]={{"书页",3888,0},{"金符",300000,2}}, 
	},
	["灭天火"] = {
 		["key_name"]=[[灭天火]],
		["need_config"]={{"书页",999,0},{"金符",100000,2}}, 
	},
	["分身术"] = {
 		["key_name"]=[[分身术]],
		["need_config"]={{"书页",1888,0},{"金符",200000,2}}, 
	},
	["冰霜群雨"] = {
 		["key_name"]=[[冰霜群雨]],
		["need_config"]={{"书页",3888,0},{"金符",300000,2}}, 
	},
	["召唤月灵"] = {
 		["key_name"]=[[召唤月灵]],
		["need_config"]={{"书页",999,0},{"金符",100000,2}}, 
	},
	["气功波"] = {
 		["key_name"]=[[气功波]],
		["need_config"]={{"书页",999,0},{"金符",100000,2}}, 
	},
	["无极真气"] = {
 		["key_name"]=[[无极真气]],
		["need_config"]={{"书页",1888,0},{"金符",200000,2}}, 
	},
	["死亡之眼"] = {
 		["key_name"]=[[死亡之眼]],
		["need_config"]={{"书页",3888,0},{"金符",300000,2}}, 
	},  
}
 return config;