---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]=[[一阶生肖]],
		["item_arr"]={"精品·鼠","精品·牛","精品·虎","精品·兔","精品·龙","精品·蛇","精品·马","精品·羊","精品·猴","精品·鸡","精品·狗","精品·猪",}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]=[[二阶生肖]],
		["item_arr"]={"传说·鼠","传说·牛","传说·虎","传说·兔","传说·龙","传说·蛇","传说·马","传说·羊","传说·猴","传说·鸡","传说·狗","传说·猪",}, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]=[[三阶生肖]],
		["item_arr"]={"上古·鼠","上古·牛","上古·虎","上古·兔","上古·龙","上古·蛇","上古·马","上古·羊","上古·猴","上古·鸡","上古·狗","上古·猪",}, 
	},
	[4] = {
 		["key_name"]=4,
		["type"]=[[神话生肖]],
		["item_arr"]={"神话·鼠","神话·牛","神话·虎","神话·兔","神话·龙","神话·蛇","神话·马","神话·羊","神话·猴","神话·鸡","神话·狗","神话·猪",}, 
	},
	["精品·鼠"] = {
 		["key_name"]=[[精品·鼠]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·牛"] = {
 		["key_name"]=[[精品·牛]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·虎"] = {
 		["key_name"]=[[精品·虎]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·兔"] = {
 		["key_name"]=[[精品·兔]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·龙"] = {
 		["key_name"]=[[精品·龙]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·蛇"] = {
 		["key_name"]=[[精品·蛇]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·马"] = {
 		["key_name"]=[[精品·马]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·羊"] = {
 		["key_name"]=[[精品·羊]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·猴"] = {
 		["key_name"]=[[精品·猴]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·鸡"] = {
 		["key_name"]=[[精品·鸡]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·狗"] = {
 		["key_name"]=[[精品·狗]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["精品·猪"] = {
 		["key_name"]=[[精品·猪]],
		["need_config"]={{"生肖精华",9,0},{"元宝",1000,2}}, 
	},
	["传说·鼠"] = {
 		["key_name"]=[[传说·鼠]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·鼠",1,0}}, 
	},
	["传说·牛"] = {
 		["key_name"]=[[传说·牛]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·牛",1,0}}, 
	},
	["传说·虎"] = {
 		["key_name"]=[[传说·虎]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·虎",1,0}}, 
	},
	["传说·兔"] = {
 		["key_name"]=[[传说·兔]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·兔",1,0}}, 
	},
	["传说·龙"] = {
 		["key_name"]=[[传说·龙]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·龙",1,0}}, 
	},
	["传说·蛇"] = {
 		["key_name"]=[[传说·蛇]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·蛇",1,0}}, 
	},
	["传说·马"] = {
 		["key_name"]=[[传说·马]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·马",1,0}}, 
	},
	["传说·羊"] = {
 		["key_name"]=[[传说·羊]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·羊",1,0}}, 
	},
	["传说·猴"] = {
 		["key_name"]=[[传说·猴]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·猴",1,0}}, 
	},
	["传说·鸡"] = {
 		["key_name"]=[[传说·鸡]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·鸡",1,0}}, 
	},
	["传说·狗"] = {
 		["key_name"]=[[传说·狗]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·狗",1,0}}, 
	},
	["传说·猪"] = {
 		["key_name"]=[[传说·猪]],
		["need_config"]={{"生肖精华",18,0},{"仙石",10,0},{"精品·猪",1,0}}, 
	},
	["上古·鼠"] = {
 		["key_name"]=[[上古·鼠]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·鼠",1,0}}, 
	},
	["上古·牛"] = {
 		["key_name"]=[[上古·牛]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·牛",1,0}}, 
	},
	["上古·虎"] = {
 		["key_name"]=[[上古·虎]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·虎",1,0}}, 
	},
	["上古·兔"] = {
 		["key_name"]=[[上古·兔]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·兔",1,0}}, 
	},
	["上古·龙"] = {
 		["key_name"]=[[上古·龙]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·龙",1,0}}, 
	},
	["上古·蛇"] = {
 		["key_name"]=[[上古·蛇]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·蛇",1,0}}, 
	},
	["上古·马"] = {
 		["key_name"]=[[上古·马]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·马",1,0}}, 
	},
	["上古·羊"] = {
 		["key_name"]=[[上古·羊]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·羊",1,0}}, 
	},
	["上古·猴"] = {
 		["key_name"]=[[上古·猴]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·猴",1,0}}, 
	},
	["上古·鸡"] = {
 		["key_name"]=[[上古·鸡]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·鸡",1,0}}, 
	},
	["上古·狗"] = {
 		["key_name"]=[[上古·狗]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·狗",1,0}}, 
	},
	["上古·猪"] = {
 		["key_name"]=[[上古·猪]],
		["need_config"]={{"生肖精华",68,0},{"仙石",100,0},{"传说·猪",1,0}}, 
	},
	["神话·鼠"] = {
 		["key_name"]=[[神话·鼠]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·鼠",1,0}}, 
	},
	["神话·牛"] = {
 		["key_name"]=[[神话·牛]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·牛",1,0}}, 
	},
	["神话·虎"] = {
 		["key_name"]=[[神话·虎]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·虎",1,0}}, 
	},
	["神话·兔"] = {
 		["key_name"]=[[神话·兔]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·兔",1,0}}, 
	},
	["神话·龙"] = {
 		["key_name"]=[[神话·龙]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·龙",1,0}}, 
	},
	["神话·蛇"] = {
 		["key_name"]=[[神话·蛇]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·蛇",1,0}}, 
	},
	["神话·马"] = {
 		["key_name"]=[[神话·马]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·马",1,0}}, 
	},
	["神话·羊"] = {
 		["key_name"]=[[神话·羊]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·羊",1,0}}, 
	},
	["神话·猴"] = {
 		["key_name"]=[[神话·猴]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·猴",1,0}}, 
	},
	["神话·鸡"] = {
 		["key_name"]=[[神话·鸡]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·鸡",1,0}}, 
	},
	["神话·狗"] = {
 		["key_name"]=[[神话·狗]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·狗",1,0}}, 
	},
	["神话·猪"] = {
 		["key_name"]=[[神话·猪]],
		["need_config"]={{"生肖精华",128,0},{"仙石",128,0},{"上古·猪",1,0}}, 
	},  
}
 return config;