---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[0] = {
 		["key_name"]=0,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[1] = {
 		["key_name"]=1,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[2] = {
 		["key_name"]=2,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[3] = {
 		["key_name"]=3,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[4] = {
 		["key_name"]=4,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[5] = {
 		["key_name"]=5,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[6] = {
 		["key_name"]=6,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[7] = {
 		["key_name"]=7,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[8] = {
 		["key_name"]=8,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},
	[9] = {
 		["key_name"]=9,
		["reward_list"]=[[血丹#3|青龙魂石#3|白虎魂石#3|朱雀魂石#3|玄武魂石#3|玛法宝典#1|洛克之羽#1|仙石#1|转生凭证#10|生肖精华#9|秘境卷轴#1|飞升凭证#1|罗盘#1]],
		["jindu_reward_list"]=[[洛克之羽#5|洛克之羽#12|洛克之羽#25|洛克之羽#58|洛克之羽#99]],
		["weight"]=[[1#100|2#100|3#100|4#100|5#100|6#2|7#100|8#100|9#100|10#100|11#100|12#100|13#50]], 
	},  
}
 return config;