---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["鬼王"] = {
 		["key_name"]=[[鬼王]], 
	},
	["啸天战甲(男)"] = {
 		["key_name"]=[[啸天战甲(男)]], 
	},
	["啸天战甲(女)"] = {
 		["key_name"]=[[啸天战甲(女)]], 
	},
	["啸天战盔"] = {
 		["key_name"]=[[啸天战盔]], 
	},
	["啸天战链"] = {
 		["key_name"]=[[啸天战链]], 
	},
	["啸天战镯"] = {
 		["key_name"]=[[啸天战镯]], 
	},
	["啸天战戒"] = {
 		["key_name"]=[[啸天战戒]], 
	},
	["啸天战带"] = {
 		["key_name"]=[[啸天战带]], 
	},
	["啸天战靴"] = {
 		["key_name"]=[[啸天战靴]], 
	},
	["七彩魔刃"] = {
 		["key_name"]=[[七彩魔刃]], 
	},
	["暗月魔衣(男)"] = {
 		["key_name"]=[[暗月魔衣(男)]], 
	},
	["暗月魔衣(女)"] = {
 		["key_name"]=[[暗月魔衣(女)]], 
	},
	["暗月魔盔"] = {
 		["key_name"]=[[暗月魔盔]], 
	},
	["暗月魔链"] = {
 		["key_name"]=[[暗月魔链]], 
	},
	["暗月魔镯"] = {
 		["key_name"]=[[暗月魔镯]], 
	},
	["暗月魔戒"] = {
 		["key_name"]=[[暗月魔戒]], 
	},
	["暗月魔带"] = {
 		["key_name"]=[[暗月魔带]], 
	},
	["暗月魔靴"] = {
 		["key_name"]=[[暗月魔靴]], 
	},
	["破魂剑"] = {
 		["key_name"]=[[破魂剑]], 
	},
	["太玄道袍(男)"] = {
 		["key_name"]=[[太玄道袍(男)]], 
	},
	["太玄道袍(女)"] = {
 		["key_name"]=[[太玄道袍(女)]], 
	},
	["太玄道盔"] = {
 		["key_name"]=[[太玄道盔]], 
	},
	["太玄道链"] = {
 		["key_name"]=[[太玄道链]], 
	},
	["太玄道镯"] = {
 		["key_name"]=[[太玄道镯]], 
	},
	["太玄道戒"] = {
 		["key_name"]=[[太玄道戒]], 
	},
	["太玄道带"] = {
 		["key_name"]=[[太玄道带]], 
	},
	["太玄道靴"] = {
 		["key_name"]=[[太玄道靴]], 
	},
	["狂雷"] = {
 		["key_name"]=[[狂雷]], 
	},
	["追日战甲(男)"] = {
 		["key_name"]=[[追日战甲(男)]], 
	},
	["追日战甲(女)"] = {
 		["key_name"]=[[追日战甲(女)]], 
	},
	["追日战盔"] = {
 		["key_name"]=[[追日战盔]], 
	},
	["追日战链"] = {
 		["key_name"]=[[追日战链]], 
	},
	["追日战镯"] = {
 		["key_name"]=[[追日战镯]], 
	},
	["追日战戒"] = {
 		["key_name"]=[[追日战戒]], 
	},
	["追日战带"] = {
 		["key_name"]=[[追日战带]], 
	},
	["追日战靴"] = {
 		["key_name"]=[[追日战靴]], 
	},
	["千年玄冰"] = {
 		["key_name"]=[[千年玄冰]], 
	},
	["揽月法衣(男)"] = {
 		["key_name"]=[[揽月法衣(男)]], 
	},
	["揽月法衣(女)"] = {
 		["key_name"]=[[揽月法衣(女)]], 
	},
	["揽月魔盔"] = {
 		["key_name"]=[[揽月魔盔]], 
	},
	["揽月魔链"] = {
 		["key_name"]=[[揽月魔链]], 
	},
	["揽月魔镯"] = {
 		["key_name"]=[[揽月魔镯]], 
	},
	["揽月魔戒"] = {
 		["key_name"]=[[揽月魔戒]], 
	},
	["揽月魔带"] = {
 		["key_name"]=[[揽月魔带]], 
	},
	["揽月魔靴"] = {
 		["key_name"]=[[揽月魔靴]], 
	},
	["太乙羽"] = {
 		["key_name"]=[[太乙羽]], 
	},
	["摘星道袍(男)"] = {
 		["key_name"]=[[摘星道袍(男)]], 
	},
	["摘星道袍(女)"] = {
 		["key_name"]=[[摘星道袍(女)]], 
	},
	["摘星道盔"] = {
 		["key_name"]=[[摘星道盔]], 
	},
	["摘星道链"] = {
 		["key_name"]=[[摘星道链]], 
	},
	["摘星道镯"] = {
 		["key_name"]=[[摘星道镯]], 
	},
	["摘星道戒"] = {
 		["key_name"]=[[摘星道戒]], 
	},
	["摘星道带"] = {
 		["key_name"]=[[摘星道带]], 
	},
	["摘星道靴"] = {
 		["key_name"]=[[摘星道靴]], 
	},
	["破魔"] = {
 		["key_name"]=[[破魔]], 
	},
	["金刚战甲(男)"] = {
 		["key_name"]=[[金刚战甲(男)]], 
	},
	["金刚战甲(女)"] = {
 		["key_name"]=[[金刚战甲(女)]], 
	},
	["金刚战盔"] = {
 		["key_name"]=[[金刚战盔]], 
	},
	["金刚战链"] = {
 		["key_name"]=[[金刚战链]], 
	},
	["金刚战镯"] = {
 		["key_name"]=[[金刚战镯]], 
	},
	["金刚战戒"] = {
 		["key_name"]=[[金刚战戒]], 
	},
	["金刚战带"] = {
 		["key_name"]=[[金刚战带]], 
	},
	["金刚战靴"] = {
 		["key_name"]=[[金刚战靴]], 
	},
	["霜之魂"] = {
 		["key_name"]=[[霜之魂]], 
	},
	["五行法衣(男)"] = {
 		["key_name"]=[[五行法衣(男)]], 
	},
	["五行法衣(女)"] = {
 		["key_name"]=[[五行法衣(女)]], 
	},
	["五行魔盔"] = {
 		["key_name"]=[[五行魔盔]], 
	},
	["五行魔链"] = {
 		["key_name"]=[[五行魔链]], 
	},
	["五行魔镯"] = {
 		["key_name"]=[[五行魔镯]], 
	},
	["五行魔戒"] = {
 		["key_name"]=[[五行魔戒]], 
	},
	["五行魔带"] = {
 		["key_name"]=[[五行魔带]], 
	},
	["五行魔靴"] = {
 		["key_name"]=[[五行魔靴]], 
	},
	["龙鳞羽"] = {
 		["key_name"]=[[龙鳞羽]], 
	},
	["神谕道袍(男)"] = {
 		["key_name"]=[[神谕道袍(男)]], 
	},
	["神谕道袍(女)"] = {
 		["key_name"]=[[神谕道袍(女)]], 
	},
	["神谕道盔"] = {
 		["key_name"]=[[神谕道盔]], 
	},
	["神谕道链"] = {
 		["key_name"]=[[神谕道链]], 
	},
	["神谕道镯"] = {
 		["key_name"]=[[神谕道镯]], 
	},
	["神谕道戒"] = {
 		["key_name"]=[[神谕道戒]], 
	},
	["神谕道带"] = {
 		["key_name"]=[[神谕道带]], 
	},
	["神谕道靴"] = {
 		["key_name"]=[[神谕道靴]], 
	},
	["耀光"] = {
 		["key_name"]=[[耀光]], 
	},
	["破坏战甲(男)"] = {
 		["key_name"]=[[破坏战甲(男)]], 
	},
	["破坏战甲(女)"] = {
 		["key_name"]=[[破坏战甲(女)]], 
	},
	["破坏战盔"] = {
 		["key_name"]=[[破坏战盔]], 
	},
	["破坏战链"] = {
 		["key_name"]=[[破坏战链]], 
	},
	["破坏战镯"] = {
 		["key_name"]=[[破坏战镯]], 
	},
	["破坏战戒"] = {
 		["key_name"]=[[破坏战戒]], 
	},
	["破坏战带"] = {
 		["key_name"]=[[破坏战带]], 
	},
	["破坏战靴"] = {
 		["key_name"]=[[破坏战靴]], 
	},
	["龙之焰"] = {
 		["key_name"]=[[龙之焰]], 
	},
	["流星魔衣(男)"] = {
 		["key_name"]=[[流星魔衣(男)]], 
	},
	["流星魔衣(女)"] = {
 		["key_name"]=[[流星魔衣(女)]], 
	},
	["流星魔盔"] = {
 		["key_name"]=[[流星魔盔]], 
	},
	["流星魔链"] = {
 		["key_name"]=[[流星魔链]], 
	},
	["流星魔镯"] = {
 		["key_name"]=[[流星魔镯]], 
	},
	["流星魔戒"] = {
 		["key_name"]=[[流星魔戒]], 
	},
	["流星魔带"] = {
 		["key_name"]=[[流星魔带]], 
	},
	["流星魔靴"] = {
 		["key_name"]=[[流星魔靴]], 
	},
	["降魔剑"] = {
 		["key_name"]=[[降魔剑]], 
	},
	["乾坤道袍(男)"] = {
 		["key_name"]=[[乾坤道袍(男)]], 
	},
	["乾坤道袍(女)"] = {
 		["key_name"]=[[乾坤道袍(女)]], 
	},
	["乾坤道盔"] = {
 		["key_name"]=[[乾坤道盔]], 
	},
	["乾坤道链"] = {
 		["key_name"]=[[乾坤道链]], 
	},
	["乾坤道镯"] = {
 		["key_name"]=[[乾坤道镯]], 
	},
	["乾坤道戒"] = {
 		["key_name"]=[[乾坤道戒]], 
	},
	["乾坤道带"] = {
 		["key_name"]=[[乾坤道带]], 
	},
	["乾坤道靴"] = {
 		["key_name"]=[[乾坤道靴]], 
	},
	["神罚"] = {
 		["key_name"]=[[神罚]], 
	},
	["帝王战甲(男)"] = {
 		["key_name"]=[[帝王战甲(男)]], 
	},
	["帝王战甲(女)"] = {
 		["key_name"]=[[帝王战甲(女)]], 
	},
	["帝王战盔"] = {
 		["key_name"]=[[帝王战盔]], 
	},
	["帝王战链"] = {
 		["key_name"]=[[帝王战链]], 
	},
	["帝王战镯"] = {
 		["key_name"]=[[帝王战镯]], 
	},
	["帝王战戒"] = {
 		["key_name"]=[[帝王战戒]], 
	},
	["帝王战带"] = {
 		["key_name"]=[[帝王战带]], 
	},
	["帝王战靴"] = {
 		["key_name"]=[[帝王战靴]], 
	},
	["金刚杖"] = {
 		["key_name"]=[[金刚杖]], 
	},
	["七彩魔衣(男)"] = {
 		["key_name"]=[[七彩魔衣(男)]], 
	},
	["七彩魔衣(女)"] = {
 		["key_name"]=[[七彩魔衣(女)]], 
	},
	["七彩魔盔"] = {
 		["key_name"]=[[七彩魔盔]], 
	},
	["七彩魔链"] = {
 		["key_name"]=[[七彩魔链]], 
	},
	["七彩魔镯"] = {
 		["key_name"]=[[七彩魔镯]], 
	},
	["七彩魔戒"] = {
 		["key_name"]=[[七彩魔戒]], 
	},
	["七彩魔带"] = {
 		["key_name"]=[[七彩魔带]], 
	},
	["七彩魔靴"] = {
 		["key_name"]=[[七彩魔靴]], 
	},
	["金光剑"] = {
 		["key_name"]=[[金光剑]], 
	},
	["虚空道袍(男)"] = {
 		["key_name"]=[[虚空道袍(男)]], 
	},
	["虚空道袍(女)"] = {
 		["key_name"]=[[虚空道袍(女)]], 
	},
	["虚空道盔"] = {
 		["key_name"]=[[虚空道盔]], 
	},
	["虚空道链"] = {
 		["key_name"]=[[虚空道链]], 
	},
	["虚空道镯"] = {
 		["key_name"]=[[虚空道镯]], 
	},
	["虚空道戒"] = {
 		["key_name"]=[[虚空道戒]], 
	},
	["虚空道带"] = {
 		["key_name"]=[[虚空道带]], 
	},
	["虚空道靴"] = {
 		["key_name"]=[[虚空道靴]], 
	},
	["天火"] = {
 		["key_name"]=[[天火]], 
	},
	["武圣战甲(男)"] = {
 		["key_name"]=[[武圣战甲(男)]], 
	},
	["武圣战甲(女)"] = {
 		["key_name"]=[[武圣战甲(女)]], 
	},
	["武圣战盔"] = {
 		["key_name"]=[[武圣战盔]], 
	},
	["武圣战链"] = {
 		["key_name"]=[[武圣战链]], 
	},
	["武圣战镯"] = {
 		["key_name"]=[[武圣战镯]], 
	},
	["武圣战戒"] = {
 		["key_name"]=[[武圣战戒]], 
	},
	["武圣战带"] = {
 		["key_name"]=[[武圣战带]], 
	},
	["武圣战靴"] = {
 		["key_name"]=[[武圣战靴]], 
	},
	["火麒麟"] = {
 		["key_name"]=[[火麒麟]], 
	},
	["雷神法衣(男)"] = {
 		["key_name"]=[[雷神法衣(男)]], 
	},
	["雷神法衣(女)"] = {
 		["key_name"]=[[雷神法衣(女)]], 
	},
	["雷神魔盔"] = {
 		["key_name"]=[[雷神魔盔]], 
	},
	["雷神魔链"] = {
 		["key_name"]=[[雷神魔链]], 
	},
	["雷神魔镯"] = {
 		["key_name"]=[[雷神魔镯]], 
	},
	["雷神魔戒"] = {
 		["key_name"]=[[雷神魔戒]], 
	},
	["雷神魔带"] = {
 		["key_name"]=[[雷神魔带]], 
	},
	["雷神魔靴"] = {
 		["key_name"]=[[雷神魔靴]], 
	},
	["斩妖剑"] = {
 		["key_name"]=[[斩妖剑]], 
	},
	["泰坦道袍(男)"] = {
 		["key_name"]=[[泰坦道袍(男)]], 
	},
	["泰坦道袍(女)"] = {
 		["key_name"]=[[泰坦道袍(女)]], 
	},
	["泰坦道盔"] = {
 		["key_name"]=[[泰坦道盔]], 
	},
	["泰坦道链"] = {
 		["key_name"]=[[泰坦道链]], 
	},
	["泰坦道镯"] = {
 		["key_name"]=[[泰坦道镯]], 
	},
	["泰坦道戒"] = {
 		["key_name"]=[[泰坦道戒]], 
	},
	["泰坦道带"] = {
 		["key_name"]=[[泰坦道带]], 
	},
	["泰坦道靴"] = {
 		["key_name"]=[[泰坦道靴]], 
	},
	["赤霄"] = {
 		["key_name"]=[[赤霄]], 
	},
	["英雄战甲(男)"] = {
 		["key_name"]=[[英雄战甲(男)]], 
	},
	["英雄战甲(女)"] = {
 		["key_name"]=[[英雄战甲(女)]], 
	},
	["英雄战盔"] = {
 		["key_name"]=[[英雄战盔]], 
	},
	["英雄战链"] = {
 		["key_name"]=[[英雄战链]], 
	},
	["英雄战镯"] = {
 		["key_name"]=[[英雄战镯]], 
	},
	["英雄战戒"] = {
 		["key_name"]=[[英雄战戒]], 
	},
	["英雄战带"] = {
 		["key_name"]=[[英雄战带]], 
	},
	["英雄战靴"] = {
 		["key_name"]=[[英雄战靴]], 
	},
	["冰与火"] = {
 		["key_name"]=[[冰与火]], 
	},
	["魔灵法衣(男)"] = {
 		["key_name"]=[[魔灵法衣(男)]], 
	},
	["魔灵法衣(女)"] = {
 		["key_name"]=[[魔灵法衣(女)]], 
	},
	["魔灵法盔"] = {
 		["key_name"]=[[魔灵法盔]], 
	},
	["魔灵法链"] = {
 		["key_name"]=[[魔灵法链]], 
	},
	["魔灵法镯"] = {
 		["key_name"]=[[魔灵法镯]], 
	},
	["魔灵法戒"] = {
 		["key_name"]=[[魔灵法戒]], 
	},
	["魔灵法带"] = {
 		["key_name"]=[[魔灵法带]], 
	},
	["魔灵法靴"] = {
 		["key_name"]=[[魔灵法靴]], 
	},
	["真武剑"] = {
 		["key_name"]=[[真武剑]], 
	},
	["阐释道袍(男)"] = {
 		["key_name"]=[[阐释道袍(男)]], 
	},
	["阐释道袍(女)"] = {
 		["key_name"]=[[阐释道袍(女)]], 
	},
	["阐释道盔"] = {
 		["key_name"]=[[阐释道盔]], 
	},
	["阐释道链"] = {
 		["key_name"]=[[阐释道链]], 
	},
	["阐释道镯"] = {
 		["key_name"]=[[阐释道镯]], 
	},
	["阐释道戒"] = {
 		["key_name"]=[[阐释道戒]], 
	},
	["阐释道带"] = {
 		["key_name"]=[[阐释道带]], 
	},
	["阐释道靴"] = {
 		["key_name"]=[[阐释道靴]], 
	},
	["绝命"] = {
 		["key_name"]=[[绝命]], 
	},
	["赤龙战甲(男)"] = {
 		["key_name"]=[[赤龙战甲(男)]], 
	},
	["赤龙战甲(女)"] = {
 		["key_name"]=[[赤龙战甲(女)]], 
	},
	["赤龙战盔"] = {
 		["key_name"]=[[赤龙战盔]], 
	},
	["赤龙战链"] = {
 		["key_name"]=[[赤龙战链]], 
	},
	["赤龙战镯"] = {
 		["key_name"]=[[赤龙战镯]], 
	},
	["赤龙战戒"] = {
 		["key_name"]=[[赤龙战戒]], 
	},
	["赤龙战带"] = {
 		["key_name"]=[[赤龙战带]], 
	},
	["赤龙战靴"] = {
 		["key_name"]=[[赤龙战靴]], 
	},
	["寒光"] = {
 		["key_name"]=[[寒光]], 
	},
	["追魂魔衣(男)"] = {
 		["key_name"]=[[追魂魔衣(男)]], 
	},
	["追魂魔衣(女)"] = {
 		["key_name"]=[[追魂魔衣(女)]], 
	},
	["追魂魔盔"] = {
 		["key_name"]=[[追魂魔盔]], 
	},
	["追魂魔链"] = {
 		["key_name"]=[[追魂魔链]], 
	},
	["追魂魔镯"] = {
 		["key_name"]=[[追魂魔镯]], 
	},
	["追魂魔戒"] = {
 		["key_name"]=[[追魂魔戒]], 
	},
	["追魂魔带"] = {
 		["key_name"]=[[追魂魔带]], 
	},
	["追魂魔靴"] = {
 		["key_name"]=[[追魂魔靴]], 
	},
	["乾坤法则"] = {
 		["key_name"]=[[乾坤法则]], 
	},
	["昆仑道袍(男)"] = {
 		["key_name"]=[[昆仑道袍(男)]], 
	},
	["昆仑道袍(女)"] = {
 		["key_name"]=[[昆仑道袍(女)]], 
	},
	["昆仑道盔"] = {
 		["key_name"]=[[昆仑道盔]], 
	},
	["昆仑道链"] = {
 		["key_name"]=[[昆仑道链]], 
	},
	["昆仑道镯"] = {
 		["key_name"]=[[昆仑道镯]], 
	},
	["昆仑道戒"] = {
 		["key_name"]=[[昆仑道戒]], 
	},
	["昆仑道带"] = {
 		["key_name"]=[[昆仑道带]], 
	},
	["昆仑道靴"] = {
 		["key_name"]=[[昆仑道靴]], 
	},
	["龙影"] = {
 		["key_name"]=[[龙影]], 
	},
	["阎罗战甲(男)"] = {
 		["key_name"]=[[阎罗战甲(男)]], 
	},
	["阎罗战甲(女)"] = {
 		["key_name"]=[[阎罗战甲(女)]], 
	},
	["阎罗战盔"] = {
 		["key_name"]=[[阎罗战盔]], 
	},
	["阎罗战链"] = {
 		["key_name"]=[[阎罗战链]], 
	},
	["阎罗战镯"] = {
 		["key_name"]=[[阎罗战镯]], 
	},
	["阎罗战戒"] = {
 		["key_name"]=[[阎罗战戒]], 
	},
	["阎罗战带"] = {
 		["key_name"]=[[阎罗战带]], 
	},
	["阎罗战靴"] = {
 		["key_name"]=[[阎罗战靴]], 
	},
	["七星"] = {
 		["key_name"]=[[七星]], 
	},
	["毁灭魔衣(男)"] = {
 		["key_name"]=[[毁灭魔衣(男)]], 
	},
	["毁灭魔衣(女)"] = {
 		["key_name"]=[[毁灭魔衣(女)]], 
	},
	["毁灭魔盔"] = {
 		["key_name"]=[[毁灭魔盔]], 
	},
	["毁灭魔链"] = {
 		["key_name"]=[[毁灭魔链]], 
	},
	["毁灭魔镯"] = {
 		["key_name"]=[[毁灭魔镯]], 
	},
	["毁灭魔戒"] = {
 		["key_name"]=[[毁灭魔戒]], 
	},
	["毁灭魔带"] = {
 		["key_name"]=[[毁灭魔带]], 
	},
	["毁灭魔靴"] = {
 		["key_name"]=[[毁灭魔靴]], 
	},
	["灵魂宝镜"] = {
 		["key_name"]=[[灵魂宝镜]], 
	},
	["避邪道袍(男)"] = {
 		["key_name"]=[[避邪道袍(男)]], 
	},
	["避邪道袍(女)"] = {
 		["key_name"]=[[避邪道袍(女)]], 
	},
	["避邪道盔"] = {
 		["key_name"]=[[避邪道盔]], 
	},
	["避邪道链"] = {
 		["key_name"]=[[避邪道链]], 
	},
	["避邪道镯"] = {
 		["key_name"]=[[避邪道镯]], 
	},
	["避邪道戒"] = {
 		["key_name"]=[[避邪道戒]], 
	},
	["避邪道带"] = {
 		["key_name"]=[[避邪道带]], 
	},
	["避邪道靴"] = {
 		["key_name"]=[[避邪道靴]], 
	},
	["神陨"] = {
 		["key_name"]=[[神陨]], 
	},
	["圣山战甲(男)"] = {
 		["key_name"]=[[圣山战甲(男)]], 
	},
	["圣山战甲(女)"] = {
 		["key_name"]=[[圣山战甲(女)]], 
	},
	["圣山战盔"] = {
 		["key_name"]=[[圣山战盔]], 
	},
	["圣山战链"] = {
 		["key_name"]=[[圣山战链]], 
	},
	["圣山战镯"] = {
 		["key_name"]=[[圣山战镯]], 
	},
	["圣山战戒"] = {
 		["key_name"]=[[圣山战戒]], 
	},
	["圣山战带"] = {
 		["key_name"]=[[圣山战带]], 
	},
	["圣山战靴"] = {
 		["key_name"]=[[圣山战靴]], 
	},
	["神怒"] = {
 		["key_name"]=[[神怒]], 
	},
	["冥王魔衣(男)"] = {
 		["key_name"]=[[冥王魔衣(男)]], 
	},
	["冥王魔衣(女)"] = {
 		["key_name"]=[[冥王魔衣(女)]], 
	},
	["冥王魔盔"] = {
 		["key_name"]=[[冥王魔盔]], 
	},
	["冥王魔链"] = {
 		["key_name"]=[[冥王魔链]], 
	},
	["冥王魔镯"] = {
 		["key_name"]=[[冥王魔镯]], 
	},
	["冥王魔戒"] = {
 		["key_name"]=[[冥王魔戒]], 
	},
	["冥王魔带"] = {
 		["key_name"]=[[冥王魔带]], 
	},
	["冥王魔靴"] = {
 		["key_name"]=[[冥王魔靴]], 
	},
	["道法自然"] = {
 		["key_name"]=[[道法自然]], 
	},
	["如来道袍(男)"] = {
 		["key_name"]=[[如来道袍(男)]], 
	},
	["如来道袍(女)"] = {
 		["key_name"]=[[如来道袍(女)]], 
	},
	["如来道盔"] = {
 		["key_name"]=[[如来道盔]], 
	},
	["如来道链"] = {
 		["key_name"]=[[如来道链]], 
	},
	["如来道镯"] = {
 		["key_name"]=[[如来道镯]], 
	},
	["如来道戒"] = {
 		["key_name"]=[[如来道戒]], 
	},
	["如来道带"] = {
 		["key_name"]=[[如来道带]], 
	},
	["如来道靴"] = {
 		["key_name"]=[[如来道靴]], 
	},  
}
 return config;