---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["name"]=[[【天字诀】]],
		["map_id"]=[[霸者大厅]],
		["npc_id"]=244,
		["weight"]=[[【天字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[2] = {
 		["key_name"]=2,
		["name"]=[[【地字诀】]],
		["map_id"]=[[牛魔寺庙]],
		["npc_id"]=245,
		["weight"]=[[【地字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[3] = {
 		["key_name"]=3,
		["name"]=[[【人字诀】]],
		["map_id"]=[[尸魔洞穴]],
		["npc_id"]=246,
		["weight"]=[[【人字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[4] = {
 		["key_name"]=4,
		["name"]=[[【鬼字诀】]],
		["map_id"]=[[骨魔石窟]],
		["npc_id"]=247,
		["weight"]=[[【鬼字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[5] = {
 		["key_name"]=5,
		["name"]=[[【神字诀】]],
		["map_id"]=[[沙影之道]],
		["npc_id"]=248,
		["weight"]=[[【神字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[6] = {
 		["key_name"]=6,
		["name"]=[[【佛字诀】]],
		["map_id"]=[[未知暗殿]],
		["npc_id"]=249,
		["weight"]=[[【佛字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[7] = {
 		["key_name"]=7,
		["name"]=[[【魔字诀】]],
		["map_id"]=[[王者禁地]],
		["npc_id"]=250,
		["weight"]=[[【魔字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[8] = {
 		["key_name"]=8,
		["name"]=[[【畜字诀】]],
		["map_id"]=[[圣域之门]],
		["npc_id"]=251,
		["weight"]=[[【畜字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[9] = {
 		["key_name"]=9,
		["name"]=[[【慑字诀】]],
		["map_id"]=[[玛雅神殿]],
		["npc_id"]=252,
		["weight"]=[[【慑字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[10] = {
 		["key_name"]=10,
		["name"]=[[【镇字诀】]],
		["map_id"]=[[炼狱禁地]],
		["npc_id"]=253,
		["weight"]=[[【镇字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[11] = {
 		["key_name"]=11,
		["name"]=[[【遁字诀】]],
		["map_id"]=[[堕落魔域]],
		["npc_id"]=254,
		["weight"]=[[【遁字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[12] = {
 		["key_name"]=12,
		["name"]=[[【物字诀】]],
		["map_id"]=[[琅琊宝阁]],
		["npc_id"]=255,
		["weight"]=[[【物字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[13] = {
 		["key_name"]=13,
		["name"]=[[【化字诀】]],
		["map_id"]=[[幽冥领地]],
		["npc_id"]=256,
		["weight"]=[[【化字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[14] = {
 		["key_name"]=14,
		["name"]=[[【阴字诀】]],
		["map_id"]=[[情缘峡谷]],
		["npc_id"]=257,
		["weight"]=[[【阴字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[15] = {
 		["key_name"]=15,
		["name"]=[[【阳字诀】]],
		["map_id"]=[[蚂蚁巢穴]],
		["npc_id"]=258,
		["weight"]=[[【阳字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},
	[16] = {
 		["key_name"]=16,
		["name"]=[[【空字诀】]],
		["map_id"]=[[真天宫殿]],
		["npc_id"]=259,
		["weight"]=[[【空字诀】|书页#10|转生凭证#10|五行精华#10|生肖精华#10|100万经验珠#1|1000万经验珠#1]], 
	},  
}
 return config;