---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["day"]=1,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[2] = {
 		["key_name"]=2,
		["day"]=2,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[3] = {
 		["key_name"]=3,
		["day"]=3,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[4] = {
 		["key_name"]=4,
		["day"]=4,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[5] = {
 		["key_name"]=5,
		["day"]=5,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[6] = {
 		["key_name"]=6,
		["day"]=6,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[7] = {
 		["key_name"]=7,
		["day"]=7,
		["giveitem"]=[[能量饮料#1#370&止疼药#1#370&飞行符#10#370]], 
	},
	[8] = {
 		["key_name"]=8,
		["day"]=[[盟重令每日]],
		["giveitem"]=[[能量饮料#3#370&医疗包#3#370&飞行符#30#370&天命石#3#370]], 
	},  
}
 return config;