---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["num"]=0,
		["giveitem_arr"]={"绑定元宝","天命石","飞行符",},
		["itemnum_arr"]={2000,1,3,}, 
	},
	[2] = {
 		["key_name"]=2,
		["num"]=10,
		["itemnum_arr"]={1,2,1,5,},
		["giveitem_arr"]={"擒龙手","天命石","神器魔盒","飞行符",},
		["giveitem1_arr"]={"分身术","天命石","神器魔盒","飞行符",},
		["giveitem2_arr"]={"无极真气","天命石","神器魔盒","飞行符",}, 
	},
	[3] = {
 		["key_name"]=3,
		["num"]=68,
		["giveitem_arr"]={"初级装扮宝箱","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,3,1,10,}, 
	},
	[4] = {
 		["key_name"]=4,
		["num"]=128,
		["giveitem_arr"]={"[足迹激活卡]火麒麟","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,4,1,20,},
		["ybbuy"]=128000, 
	},
	[5] = {
 		["key_name"]=5,
		["num"]=258,
		["giveitem_arr"]={"高级装扮宝箱","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,5,1,30,}, 
	},
	[6] = {
 		["key_name"]=6,
		["num"]=328,
		["giveitem_arr"]={"虚空魂环[激活卡]","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,6,1,40,},
		["ybbuy"]=328000, 
	},
	[7] = {
 		["key_name"]=7,
		["num"]=648,
		["giveitem_arr"]={"史诗装扮宝箱","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,7,1,50,}, 
	},
	[8] = {
 		["key_name"]=8,
		["num"]=838,
		["giveitem_arr"]={"[宠物激活卡]汪星人","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,8,1,60,},
		["ybbuy"]=838000, 
	},
	[9] = {
 		["key_name"]=9,
		["num"]=998,
		["giveitem_arr"]={"大神豪(称号)","天命石","神器魔盒","飞行符",},
		["itemnum_arr"]={1,9,1,100,},
		["ybbuy"]=998000, 
	},  
}
 return config;