---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["level"]=40,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#1000#0]], 
	},
	[2] = {
 		["key_name"]=2,
		["level"]=45,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#2000#0]], 
	},
	[3] = {
 		["key_name"]=3,
		["level"]=50,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#3000#0]], 
	},
	[4] = {
 		["key_name"]=4,
		["level"]=55,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#5000#0]], 
	},
	[5] = {
 		["key_name"]=5,
		["level"]=60,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#8000#0]], 
	},
	[6] = {
 		["key_name"]=6,
		["level"]=65,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#12000#0]], 
	},
	[7] = {
 		["key_name"]=7,
		["level"]=70,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#16000#0]], 
	},
	[8] = {
 		["key_name"]=8,
		["level"]=75,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#20000#0]], 
	},
	[9] = {
 		["key_name"]=9,
		["level"]=80,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#30000#0]], 
	},
	[10] = {
 		["key_name"]=10,
		["level"]=85,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#40000#0]], 
	},
	[11] = {
 		["key_name"]=11,
		["level"]=90,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#50000#0]], 
	},
	[12] = {
 		["key_name"]=12,
		["level"]=91,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#60000#0]], 
	},
	[13] = {
 		["key_name"]=13,
		["level"]=92,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#70000#0]], 
	},
	[14] = {
 		["key_name"]=14,
		["level"]=93,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#80000#0]], 
	},
	[15] = {
 		["key_name"]=15,
		["level"]=94,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#90000#0]], 
	},
	[16] = {
 		["key_name"]=16,
		["level"]=95,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#100000#0]], 
	},
	[17] = {
 		["key_name"]=17,
		["level"]=96,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#120000#0]], 
	},
	[18] = {
 		["key_name"]=18,
		["level"]=97,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#140000#0]], 
	},
	[19] = {
 		["key_name"]=19,
		["level"]=98,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#160000#0]], 
	},
	[20] = {
 		["key_name"]=20,
		["level"]=99,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#180000#0]], 
	},
	[21] = {
 		["key_name"]=21,
		["level"]=100,
		["giveitem"]=[[天命石#1#370&飞行符#10#370]],
		["giveitem1"]=[[元宝#200000#0]], 
	},  
}
 return config;